# Comparing `tmp/flowtask-5.2.8-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip` & `tmp/flowtask-5.2.9-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,323 +1,323 @@
-Zip file size: 3190432 bytes, number of entries: 321
-drwxr-xr-x  2.0 unx        0 b- stor 23-Dec-29 16:01 plugins/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Dec-29 16:01 flowtask.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Dec-29 16:01 flowtask-5.2.8.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Dec-29 16:01 flowtask/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Dec-29 16:01 plugins/components/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Dec-29 16:01 plugins/sources/
--rw-r--r--  2.0 unx     1112 b- defN 23-Dec-29 16:01 plugins/components/CreateQR.py
--rw-r--r--  2.0 unx       68 b- defN 23-Dec-29 16:01 plugins/components/__init__.py
--rw-r--r--  2.0 unx      623 b- defN 23-Dec-29 16:01 plugins/components/TestComponent.py
--rw-r--r--  2.0 unx      299 b- defN 23-Dec-29 16:01 plugins/components/Use1.py
--rw-r--r--  2.0 unx     5352 b- defN 23-Dec-29 16:01 plugins/components/Workplace.py
--rw-r--r--  2.0 unx     2757 b- defN 23-Dec-29 16:01 plugins/sources/get_populartimes.py
--rw-r--r--  2.0 unx    23000 b- defN 23-Dec-29 16:01 plugins/sources/hubspot.py
--rw-r--r--  2.0 unx    19826 b- defN 23-Dec-29 16:01 plugins/sources/mobileinsight.py
--rw-r--r--  2.0 unx    23757 b- defN 23-Dec-29 16:01 plugins/sources/icims.py

     <9d>   DW_AT_byte_size   : (data1) 8
     <9e>   DW_AT_type        : (ref4) <0x97>, char
  <1><a2>: Abbrev Number: 23 (DW_TAG_typedef)
-    <a3>   DW_AT_name        : (strp) (offset: 0x25ba): ssize_t
+    <a3>   DW_AT_name        : (strp) (offset: 0x25cf): ssize_t
     <a7>   DW_AT_decl_file   : (data1) 7
     <a8>   DW_AT_decl_line   : (data1) 102
     <a9>   DW_AT_decl_column : (data1) 19
     <aa>   DW_AT_type        : (ref4) <0x7e>, __ssize_t, long int
  <1><ae>: Abbrev Number: 61 (DW_TAG_typedef)
-    <af>   DW_AT_name        : (strp) (offset: 0x2ea6): wchar_t
+    <af>   DW_AT_name        : (strp) (offset: 0x2ebb): wchar_t
     <b3>   DW_AT_decl_file   : (data1) 5
     <b4>   DW_AT_decl_line   : (data2) 321
     <b6>   DW_AT_decl_column : (data1) 24
     <b7>   DW_AT_type        : (ref4) <0x64>, int
  <1><bb>: Abbrev Number: 59 (DW_TAG_base_type)
     <bc>   DW_AT_byte_size   : (data1) 8
     <bd>   DW_AT_encoding    : (data1) 5	(signed)
-    <be>   DW_AT_name        : (strp) (offset: 0x4c22): long long int
+    <be>   DW_AT_name        : (strp) (offset: 0x4c20): long long int
  <1><c2>: Abbrev Number: 23 (DW_TAG_typedef)
-    <c3>   DW_AT_name        : (strp) (offset: 0x350d): int32_t
+    <c3>   DW_AT_name        : (strp) (offset: 0x3535): int32_t
     <c7>   DW_AT_decl_file   : (data1) 8
     <c8>   DW_AT_decl_line   : (data1) 196
     <c9>   DW_AT_decl_column : (data1) 1
     <ca>   DW_AT_type        : (ref4) <0x64>, int
  <1><ce>: Abbrev Number: 23 (DW_TAG_typedef)
-    <cf>   DW_AT_name        : (strp) (offset: 0x16c3): int64_t
+    <cf>   DW_AT_name        : (strp) (offset: 0x16d8): int64_t
     <d3>   DW_AT_decl_file   : (data1) 8
     <d4>   DW_AT_decl_line   : (data1) 197
     <d5>   DW_AT_decl_column : (data1) 1
     <d6>   DW_AT_type        : (ref4) <0x70>, long int
  <1><da>: Abbrev Number: 59 (DW_TAG_base_type)
     <db>   DW_AT_byte_size   : (data1) 8
     <dc>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <dd>   DW_AT_name        : (strp) (offset: 0x4689): long long unsigned int
+    <dd>   DW_AT_name        : (strp) (offset: 0x4687): long long unsigned int
  <1><e1>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <e2>   DW_AT_byte_size   : (data1) 8
     <e3>   DW_AT_type        : (ref4) <0xe7>
  <1><e7>: Abbrev Number: 110 (DW_TAG_const_type)
  <1><e8>: Abbrev Number: 23 (DW_TAG_typedef)
-    <e9>   DW_AT_name        : (strp) (offset: 0x1e1d): uint8_t
+    <e9>   DW_AT_name        : (strp) (offset: 0x1e32): uint8_t
     <ed>   DW_AT_decl_file   : (data1) 9
     <ee>   DW_AT_decl_line   : (data1) 48
     <ef>   DW_AT_decl_column : (data1) 24
     <f0>   DW_AT_type        : (ref4) <0x41>, unsigned char
  <1><f4>: Abbrev Number: 23 (DW_TAG_typedef)
     <f5>   DW_AT_name        : (strp) (offset: 0x613): uint16_t
     <f9>   DW_AT_decl_file   : (data1) 9
     <fa>   DW_AT_decl_line   : (data1) 49
     <fb>   DW_AT_decl_column : (data1) 28
     <fc>   DW_AT_type        : (ref4) <0x48>, short unsigned int
  <1><100>: Abbrev Number: 23 (DW_TAG_typedef)
-    <101>   DW_AT_name        : (strp) (offset: 0x350c): uint32_t
+    <101>   DW_AT_name        : (strp) (offset: 0x3534): uint32_t
     <105>   DW_AT_decl_file   : (data1) 9
     <106>   DW_AT_decl_line   : (data1) 51
     <107>   DW_AT_decl_column : (data1) 23
     <108>   DW_AT_type        : (ref4) <0x4f>, unsigned int
  <1><10c>: Abbrev Number: 23 (DW_TAG_typedef)
-    <10d>   DW_AT_name        : (strp) (offset: 0x16c2): uint64_t
+    <10d>   DW_AT_name        : (strp) (offset: 0x16d7): uint64_t
     <111>   DW_AT_decl_file   : (data1) 9
     <112>   DW_AT_decl_line   : (data1) 55
     <113>   DW_AT_decl_column : (data1) 27
     <114>   DW_AT_type        : (ref4) <0x35>, long unsigned int
  <1><118>: Abbrev Number: 23 (DW_TAG_typedef)
-    <119>   DW_AT_name        : (strp) (offset: 0x4b4f): Py_ssize_t
+    <119>   DW_AT_name        : (strp) (offset: 0x4b4d): Py_ssize_t
     <11d>   DW_AT_decl_file   : (data1) 10
     <11e>   DW_AT_decl_line   : (data1) 105
     <11f>   DW_AT_decl_column : (data1) 25
     <120>   DW_AT_type        : (ref4) <0xa2>, ssize_t, __ssize_t, long int
  <1><124>: Abbrev Number: 39 (DW_TAG_const_type)
     <125>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><129>: Abbrev Number: 23 (DW_TAG_typedef)
-    <12a>   DW_AT_name        : (strp) (offset: 0x2419): Py_hash_t
+    <12a>   DW_AT_name        : (strp) (offset: 0x242e): Py_hash_t
     <12e>   DW_AT_decl_file   : (data1) 10
     <12f>   DW_AT_decl_line   : (data1) 114
     <130>   DW_AT_decl_column : (data1) 20
     <131>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><135>: Abbrev Number: 59 (DW_TAG_base_type)
     <136>   DW_AT_byte_size   : (data1) 4
     <137>   DW_AT_encoding    : (data1) 4	(float)
-    <138>   DW_AT_name        : (strp) (offset: 0x33fe): float
+    <138>   DW_AT_name        : (strp) (offset: 0x3413): float
  <1><13c>: Abbrev Number: 59 (DW_TAG_base_type)
     <13d>   DW_AT_byte_size   : (data1) 8
     <13e>   DW_AT_encoding    : (data1) 4	(float)
-    <13f>   DW_AT_name        : (strp) (offset: 0x362d): double
+    <13f>   DW_AT_name        : (strp) (offset: 0x3655): double
  <1><143>: Abbrev Number: 60 (DW_TAG_structure_type)
-    <144>   DW_AT_name        : (strp) (offset: 0x4a74): timezone
+    <144>   DW_AT_name        : (strp) (offset: 0x4a72): timezone
     <148>   DW_AT_byte_size   : (data1) 8
     <149>   DW_AT_decl_file   : (data1) 11
     <14a>   DW_AT_decl_line   : (data1) 56
     <14b>   DW_AT_decl_column : (data1) 8
     <14c>   DW_AT_sibling     : (ref4) <0x16b>
  <2><150>: Abbrev Number: 9 (DW_TAG_member)
-    <151>   DW_AT_name        : (strp) (offset: 0x5359): tz_minuteswest
+    <151>   DW_AT_name        : (strp) (offset: 0x5357): tz_minuteswest
     <155>   DW_AT_decl_file   : (data1) 11
     <156>   DW_AT_decl_line   : (data1) 58
     <157>   DW_AT_decl_column : (data1) 9
     <158>   DW_AT_type        : (ref4) <0x64>, int
     <15c>   DW_AT_data_member_location: (data1) 0
  <2><15d>: Abbrev Number: 9 (DW_TAG_member)
-    <15e>   DW_AT_name        : (strp) (offset: 0x3102): tz_dsttime
+    <15e>   DW_AT_name        : (strp) (offset: 0x3117): tz_dsttime
     <162>   DW_AT_decl_file   : (data1) 11
     <163>   DW_AT_decl_line   : (data1) 59
     <164>   DW_AT_decl_column : (data1) 9
     <165>   DW_AT_type        : (ref4) <0x64>, int
     <169>   DW_AT_data_member_location: (data1) 4
  <2><16a>: Abbrev Number: 0
  <1><16b>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <16c>   DW_AT_byte_size   : (data1) 8
     <16d>   DW_AT_type        : (ref4) <0x143>, timezone
  <1><171>: Abbrev Number: 111 (DW_TAG_restrict_type)
     <172>   DW_AT_type        : (ref4) <0x16b>, timezone
  <1><176>: Abbrev Number: 23 (DW_TAG_typedef)
-    <177>   DW_AT_name        : (strp) (offset: 0x121a): PyTypeObject
+    <177>   DW_AT_name        : (strp) (offset: 0x122f): PyTypeObject
     <17b>   DW_AT_decl_file   : (data1) 2
     <17c>   DW_AT_decl_line   : (data1) 66
     <17d>   DW_AT_decl_column : (data1) 28
     <17e>   DW_AT_type        : (ref4) <0x187>, _typeobject
  <1><182>: Abbrev Number: 39 (DW_TAG_const_type)
     <183>   DW_AT_type        : (ref4) <0x176>, PyTypeObject, _typeobject
  <1><187>: Abbrev Number: 97 (DW_TAG_structure_type)
     <188>   DW_AT_name        : (strp) (offset: 0x946): _typeobject
     <18c>   DW_AT_byte_size   : (data2) 408
     <18e>   DW_AT_decl_file   : (data1) 12
     <18f>   DW_AT_decl_line   : (data1) 193
     <190>   DW_AT_decl_column : (data1) 8
     <191>   DW_AT_sibling     : (ref4) <0x435>
  <2><195>: Abbrev Number: 9 (DW_TAG_member)
-    <196>   DW_AT_name        : (strp) (offset: 0x1212): ob_base
+    <196>   DW_AT_name        : (strp) (offset: 0x1227): ob_base
     <19a>   DW_AT_decl_file   : (data1) 12
     <19b>   DW_AT_decl_line   : (data1) 194
     <19c>   DW_AT_decl_column : (data1) 5
     <19d>   DW_AT_type        : (ref4) <0x498>, PyVarObject
     <1a1>   DW_AT_data_member_location: (data1) 0
  <2><1a2>: Abbrev Number: 9 (DW_TAG_member)
-    <1a3>   DW_AT_name        : (strp) (offset: 0x2b18): tp_name
+    <1a3>   DW_AT_name        : (strp) (offset: 0x2b2d): tp_name
     <1a7>   DW_AT_decl_file   : (data1) 12
     <1a8>   DW_AT_decl_line   : (data1) 195
     <1a9>   DW_AT_decl_column : (data1) 17
     <1aa>   DW_AT_type        : (ref4) <0x9c>, char
     <1ae>   DW_AT_data_member_location: (data1) 24
  <2><1af>: Abbrev Number: 9 (DW_TAG_member)
-    <1b0>   DW_AT_name        : (strp) (offset: 0x52b9): tp_basicsize
+    <1b0>   DW_AT_name        : (strp) (offset: 0x52b7): tp_basicsize
     <1b4>   DW_AT_decl_file   : (data1) 12
     <1b5>   DW_AT_decl_line   : (data1) 196
     <1b6>   DW_AT_decl_column : (data1) 16
     <1b7>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1bb>   DW_AT_data_member_location: (data1) 32
  <2><1bc>: Abbrev Number: 9 (DW_TAG_member)
     <1bd>   DW_AT_name        : (strp) (offset: 0x55d): tp_itemsize
@@ -233,246 +233,246 @@
     <1ca>   DW_AT_name        : (strp) (offset: 0x8be): tp_dealloc
     <1ce>   DW_AT_decl_file   : (data1) 12
     <1cf>   DW_AT_decl_line   : (data1) 200
     <1d0>   DW_AT_decl_column : (data1) 16
     <1d1>   DW_AT_type        : (ref4) <0x673>, destructor
     <1d5>   DW_AT_data_member_location: (data1) 48
  <2><1d6>: Abbrev Number: 9 (DW_TAG_member)
-    <1d7>   DW_AT_name        : (strp) (offset: 0x34d6): tp_vectorcall_offset
+    <1d7>   DW_AT_name        : (strp) (offset: 0x34fe): tp_vectorcall_offset
     <1db>   DW_AT_decl_file   : (data1) 12
     <1dc>   DW_AT_decl_line   : (data1) 201
     <1dd>   DW_AT_decl_column : (data1) 16
     <1de>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1e2>   DW_AT_data_member_location: (data1) 56
  <2><1e3>: Abbrev Number: 9 (DW_TAG_member)
     <1e4>   DW_AT_name        : (strp) (offset: 0x1d2): tp_getattr
     <1e8>   DW_AT_decl_file   : (data1) 12
     <1e9>   DW_AT_decl_line   : (data1) 202
     <1ea>   DW_AT_decl_column : (data1) 17
     <1eb>   DW_AT_type        : (ref4) <0x690>, getattrfunc, PyObject, _object
     <1ef>   DW_AT_data_member_location: (data1) 64
  <2><1f0>: Abbrev Number: 9 (DW_TAG_member)
-    <1f1>   DW_AT_name        : (strp) (offset: 0x143e): tp_setattr
+    <1f1>   DW_AT_name        : (strp) (offset: 0x1453): tp_setattr
     <1f5>   DW_AT_decl_file   : (data1) 12
     <1f6>   DW_AT_decl_line   : (data1) 203
     <1f7>   DW_AT_decl_column : (data1) 17
     <1f8>   DW_AT_type        : (ref4) <0x6c2>, setattrfunc, int
     <1fc>   DW_AT_data_member_location: (data1) 72
  <2><1fd>: Abbrev Number: 9 (DW_TAG_member)
     <1fe>   DW_AT_name        : (strp) (offset: 0x34f): tp_as_async
     <202>   DW_AT_decl_file   : (data1) 12
     <203>   DW_AT_decl_line   : (data1) 204
     <204>   DW_AT_decl_column : (data1) 21
     <205>   DW_AT_type        : (ref4) <0xc6c>, PyAsyncMethods
     <209>   DW_AT_data_member_location: (data1) 80
  <2><20a>: Abbrev Number: 9 (DW_TAG_member)
-    <20b>   DW_AT_name        : (strp) (offset: 0x4a9d): tp_repr
+    <20b>   DW_AT_name        : (strp) (offset: 0x4a9b): tp_repr
     <20f>   DW_AT_decl_file   : (data1) 12
     <210>   DW_AT_decl_line   : (data1) 206
     <211>   DW_AT_decl_column : (data1) 14
     <212>   DW_AT_type        : (ref4) <0x6f9>, reprfunc, PyObject, _object
     <216>   DW_AT_data_member_location: (data1) 88
  <2><217>: Abbrev Number: 9 (DW_TAG_member)
-    <218>   DW_AT_name        : (strp) (offset: 0x3664): tp_as_number
+    <218>   DW_AT_name        : (strp) (offset: 0x368c): tp_as_number
     <21c>   DW_AT_decl_file   : (data1) 12
     <21d>   DW_AT_decl_line   : (data1) 210
     <21e>   DW_AT_decl_column : (data1) 22
     <21f>   DW_AT_type        : (ref4) <0xc72>, PyNumberMethods
     <223>   DW_AT_data_member_location: (data1) 96
  <2><224>: Abbrev Number: 9 (DW_TAG_member)
-    <225>   DW_AT_name        : (strp) (offset: 0x2bfc): tp_as_sequence
+    <225>   DW_AT_name        : (strp) (offset: 0x2c11): tp_as_sequence
     <229>   DW_AT_decl_file   : (data1) 12
     <22a>   DW_AT_decl_line   : (data1) 211
     <22b>   DW_AT_decl_column : (data1) 24
     <22c>   DW_AT_type        : (ref4) <0xc78>, PySequenceMethods
     <230>   DW_AT_data_member_location: (data1) 104
  <2><231>: Abbrev Number: 9 (DW_TAG_member)
-    <232>   DW_AT_name        : (strp) (offset: 0x198b): tp_as_mapping
+    <232>   DW_AT_name        : (strp) (offset: 0x19a0): tp_as_mapping
     <236>   DW_AT_decl_file   : (data1) 12
     <237>   DW_AT_decl_line   : (data1) 212
     <238>   DW_AT_decl_column : (data1) 23
     <239>   DW_AT_type        : (ref4) <0xc7e>, PyMappingMethods
     <23d>   DW_AT_data_member_location: (data1) 112
  <2><23e>: Abbrev Number: 9 (DW_TAG_member)
-    <23f>   DW_AT_name        : (strp) (offset: 0x3ca4): tp_hash
+    <23f>   DW_AT_name        : (strp) (offset: 0x3cbc): tp_hash
     <243>   DW_AT_decl_file   : (data1) 12
     <244>   DW_AT_decl_line   : (data1) 216
     <245>   DW_AT_decl_column : (data1) 14
     <246>   DW_AT_type        : (ref4) <0x705>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <24a>   DW_AT_data_member_location: (data1) 120
  <2><24b>: Abbrev Number: 9 (DW_TAG_member)
-    <24c>   DW_AT_name        : (strp) (offset: 0x1080): tp_call
+    <24c>   DW_AT_name        : (strp) (offset: 0x1095): tp_call
     <250>   DW_AT_decl_file   : (data1) 12
     <251>   DW_AT_decl_line   : (data1) 217
     <252>   DW_AT_decl_column : (data1) 17
     <253>   DW_AT_type        : (ref4) <0x4f6>, ternaryfunc, PyObject, _object
     <257>   DW_AT_data_member_location: (data1) 128
  <2><258>: Abbrev Number: 9 (DW_TAG_member)
-    <259>   DW_AT_name        : (strp) (offset: 0x1112): tp_str
+    <259>   DW_AT_name        : (strp) (offset: 0x1127): tp_str
     <25d>   DW_AT_decl_file   : (data1) 12
     <25e>   DW_AT_decl_line   : (data1) 218
     <25f>   DW_AT_decl_column : (data1) 14
     <260>   DW_AT_type        : (ref4) <0x6f9>, reprfunc, PyObject, _object
     <264>   DW_AT_data_member_location: (data1) 136
  <2><265>: Abbrev Number: 9 (DW_TAG_member)
-    <266>   DW_AT_name        : (strp) (offset: 0x2f9e): tp_getattro
+    <266>   DW_AT_name        : (strp) (offset: 0x2fb3): tp_getattro
     <26a>   DW_AT_decl_file   : (data1) 12
     <26b>   DW_AT_decl_line   : (data1) 219
     <26c>   DW_AT_decl_column : (data1) 18
     <26d>   DW_AT_type        : (ref4) <0x6b6>, getattrofunc, PyObject, _object
     <271>   DW_AT_data_member_location: (data1) 144
  <2><272>: Abbrev Number: 9 (DW_TAG_member)
-    <273>   DW_AT_name        : (strp) (offset: 0x4256): tp_setattro
+    <273>   DW_AT_name        : (strp) (offset: 0x426e): tp_setattro
     <277>   DW_AT_decl_file   : (data1) 12
     <278>   DW_AT_decl_line   : (data1) 220
     <279>   DW_AT_decl_column : (data1) 18
     <27a>   DW_AT_type        : (ref4) <0x6ed>, setattrofunc, int
     <27e>   DW_AT_data_member_location: (data1) 152
  <2><27f>: Abbrev Number: 9 (DW_TAG_member)
-    <280>   DW_AT_name        : (strp) (offset: 0x2c37): tp_as_buffer
+    <280>   DW_AT_name        : (strp) (offset: 0x2c4c): tp_as_buffer
     <284>   DW_AT_decl_file   : (data1) 12
     <285>   DW_AT_decl_line   : (data1) 223
     <286>   DW_AT_decl_column : (data1) 20
     <287>   DW_AT_type        : (ref4) <0xc84>, PyBufferProcs
     <28b>   DW_AT_data_member_location: (data1) 160
  <2><28c>: Abbrev Number: 9 (DW_TAG_member)
-    <28d>   DW_AT_name        : (strp) (offset: 0x4e41): tp_flags
+    <28d>   DW_AT_name        : (strp) (offset: 0x4e3f): tp_flags
     <291>   DW_AT_decl_file   : (data1) 12
     <292>   DW_AT_decl_line   : (data1) 226
     <293>   DW_AT_decl_column : (data1) 19
     <294>   DW_AT_type        : (ref4) <0x35>, long unsigned int
     <298>   DW_AT_data_member_location: (data1) 168
  <2><299>: Abbrev Number: 9 (DW_TAG_member)
-    <29a>   DW_AT_name        : (strp) (offset: 0x37bb): tp_doc
+    <29a>   DW_AT_name        : (strp) (offset: 0x37e3): tp_doc
     <29e>   DW_AT_decl_file   : (data1) 12
     <29f>   DW_AT_decl_line   : (data1) 228
     <2a0>   DW_AT_decl_column : (data1) 17
     <2a1>   DW_AT_type        : (ref4) <0x9c>, char
     <2a5>   DW_AT_data_member_location: (data1) 176
  <2><2a6>: Abbrev Number: 9 (DW_TAG_member)
-    <2a7>   DW_AT_name        : (strp) (offset: 0x2c2b): tp_traverse
+    <2a7>   DW_AT_name        : (strp) (offset: 0x2c40): tp_traverse
     <2ab>   DW_AT_decl_file   : (data1) 12
     <2ac>   DW_AT_decl_line   : (data1) 232
     <2ad>   DW_AT_decl_column : (data1) 18
     <2ae>   DW_AT_type        : (ref4) <0x62b>, traverseproc, int
     <2b2>   DW_AT_data_member_location: (data1) 184
  <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
-    <2b4>   DW_AT_name        : (strp) (offset: 0x3d3a): tp_clear
+    <2b4>   DW_AT_name        : (strp) (offset: 0x3d52): tp_clear
     <2b8>   DW_AT_decl_file   : (data1) 12
     <2b9>   DW_AT_decl_line   : (data1) 235
     <2ba>   DW_AT_decl_column : (data1) 13
     <2bb>   DW_AT_type        : (ref4) <0x521>, inquiry, int
     <2bf>   DW_AT_data_member_location: (data1) 192
  <2><2c0>: Abbrev Number: 9 (DW_TAG_member)
     <2c1>   DW_AT_name        : (strp) (offset: 0xb6e): tp_richcompare
     <2c5>   DW_AT_decl_file   : (data1) 12
     <2c6>   DW_AT_decl_line   : (data1) 239
     <2c7>   DW_AT_decl_column : (data1) 17
     <2c8>   DW_AT_type        : (ref4) <0x726>, richcmpfunc, PyObject, _object
     <2cc>   DW_AT_data_member_location: (data1) 200
  <2><2cd>: Abbrev Number: 9 (DW_TAG_member)
-    <2ce>   DW_AT_name        : (strp) (offset: 0x36bd): tp_weaklistoffset
+    <2ce>   DW_AT_name        : (strp) (offset: 0x36e5): tp_weaklistoffset
     <2d2>   DW_AT_decl_file   : (data1) 12
     <2d3>   DW_AT_decl_line   : (data1) 242
     <2d4>   DW_AT_decl_column : (data1) 16
     <2d5>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <2d9>   DW_AT_data_member_location: (data1) 208
  <2><2da>: Abbrev Number: 9 (DW_TAG_member)
-    <2db>   DW_AT_name        : (strp) (offset: 0x4427): tp_iter
+    <2db>   DW_AT_name        : (strp) (offset: 0x4425): tp_iter
     <2df>   DW_AT_decl_file   : (data1) 12
     <2e0>   DW_AT_decl_line   : (data1) 245
     <2e1>   DW_AT_decl_column : (data1) 17
     <2e2>   DW_AT_type        : (ref4) <0x751>, getiterfunc, PyObject, _object
     <2e6>   DW_AT_data_member_location: (data1) 216
  <2><2e7>: Abbrev Number: 9 (DW_TAG_member)
-    <2e8>   DW_AT_name        : (strp) (offset: 0x4371): tp_iternext
+    <2e8>   DW_AT_name        : (strp) (offset: 0x436f): tp_iternext
     <2ec>   DW_AT_decl_file   : (data1) 12
     <2ed>   DW_AT_decl_line   : (data1) 246
     <2ee>   DW_AT_decl_column : (data1) 18
     <2ef>   DW_AT_type        : (ref4) <0x75d>, iternextfunc, PyObject, _object
     <2f3>   DW_AT_data_member_location: (data1) 224
  <2><2f4>: Abbrev Number: 9 (DW_TAG_member)
-    <2f5>   DW_AT_name        : (strp) (offset: 0x3087): tp_methods
+    <2f5>   DW_AT_name        : (strp) (offset: 0x309c): tp_methods
     <2f9>   DW_AT_decl_file   : (data1) 12
     <2fa>   DW_AT_decl_line   : (data1) 249
     <2fb>   DW_AT_decl_column : (data1) 25
     <2fc>   DW_AT_type        : (ref4) <0xccc>, PyMethodDef
     <300>   DW_AT_data_member_location: (data1) 232
  <2><301>: Abbrev Number: 9 (DW_TAG_member)
-    <302>   DW_AT_name        : (strp) (offset: 0x3fe3): tp_members
+    <302>   DW_AT_name        : (strp) (offset: 0x3ffb): tp_members
     <306>   DW_AT_decl_file   : (data1) 12
     <307>   DW_AT_decl_line   : (data1) 250
     <308>   DW_AT_decl_column : (data1) 25
     <309>   DW_AT_type        : (ref4) <0xd21>, PyMemberDef
     <30d>   DW_AT_data_member_location: (data1) 240
  <2><30e>: Abbrev Number: 9 (DW_TAG_member)
-    <30f>   DW_AT_name        : (strp) (offset: 0x4338): tp_getset
+    <30f>   DW_AT_name        : (strp) (offset: 0x4350): tp_getset
     <313>   DW_AT_decl_file   : (data1) 12
     <314>   DW_AT_decl_line   : (data1) 251
     <315>   DW_AT_decl_column : (data1) 25
     <316>   DW_AT_type        : (ref4) <0xd76>, PyGetSetDef
     <31a>   DW_AT_data_member_location: (data1) 248
  <2><31b>: Abbrev Number: 64 (DW_TAG_member)
-    <31c>   DW_AT_name        : (strp) (offset: 0x4523): tp_base
+    <31c>   DW_AT_name        : (strp) (offset: 0x4521): tp_base
     <320>   DW_AT_decl_file   : (data1) 12
     <321>   DW_AT_decl_line   : (data1) 252
     <322>   DW_AT_decl_column : (data1) 25
     <323>   DW_AT_type        : (ref4) <0xd7c>, _typeobject
     <327>   DW_AT_data_member_location: (data2) 256
  <2><329>: Abbrev Number: 64 (DW_TAG_member)
-    <32a>   DW_AT_name        : (strp) (offset: 0x1967): tp_dict
+    <32a>   DW_AT_name        : (strp) (offset: 0x197c): tp_dict
     <32e>   DW_AT_decl_file   : (data1) 12
     <32f>   DW_AT_decl_line   : (data1) 253
     <330>   DW_AT_decl_column : (data1) 15
     <331>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
     <335>   DW_AT_data_member_location: (data2) 264
  <2><337>: Abbrev Number: 64 (DW_TAG_member)
-    <338>   DW_AT_name        : (strp) (offset: 0x4404): tp_descr_get
+    <338>   DW_AT_name        : (strp) (offset: 0x4402): tp_descr_get
     <33c>   DW_AT_decl_file   : (data1) 12
     <33d>   DW_AT_decl_line   : (data1) 254
     <33e>   DW_AT_decl_column : (data1) 18
     <33f>   DW_AT_type        : (ref4) <0x769>, descrgetfunc, PyObject, _object
     <343>   DW_AT_data_member_location: (data2) 272
  <2><345>: Abbrev Number: 64 (DW_TAG_member)
-    <346>   DW_AT_name        : (strp) (offset: 0x51ca): tp_descr_set
+    <346>   DW_AT_name        : (strp) (offset: 0x51c8): tp_descr_set
     <34a>   DW_AT_decl_file   : (data1) 12
     <34b>   DW_AT_decl_line   : (data1) 255
     <34c>   DW_AT_decl_column : (data1) 18
     <34d>   DW_AT_type        : (ref4) <0x775>, descrsetfunc, int
     <351>   DW_AT_data_member_location: (data2) 280
  <2><353>: Abbrev Number: 25 (DW_TAG_member)
-    <354>   DW_AT_name        : (strp) (offset: 0x1598): tp_dictoffset
+    <354>   DW_AT_name        : (strp) (offset: 0x15ad): tp_dictoffset
     <358>   DW_AT_decl_file   : (data1) 12
     <359>   DW_AT_decl_line   : (data2) 256
     <35b>   DW_AT_decl_column : (data1) 16
     <35c>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <360>   DW_AT_data_member_location: (data2) 288
  <2><362>: Abbrev Number: 25 (DW_TAG_member)
-    <363>   DW_AT_name        : (strp) (offset: 0x18ca): tp_init
+    <363>   DW_AT_name        : (strp) (offset: 0x18df): tp_init
     <367>   DW_AT_decl_file   : (data1) 12
     <368>   DW_AT_decl_line   : (data2) 257
     <36a>   DW_AT_decl_column : (data1) 14
     <36b>   DW_AT_type        : (ref4) <0x781>, initproc, int
     <36f>   DW_AT_data_member_location: (data2) 296
  <2><371>: Abbrev Number: 25 (DW_TAG_member)
-    <372>   DW_AT_name        : (strp) (offset: 0x2d97): tp_alloc
+    <372>   DW_AT_name        : (strp) (offset: 0x2dac): tp_alloc
     <376>   DW_AT_decl_file   : (data1) 12
     <377>   DW_AT_decl_line   : (data2) 258
     <379>   DW_AT_decl_column : (data1) 15
     <37a>   DW_AT_type        : (ref4) <0x7b8>, allocfunc, PyObject, _object
     <37e>   DW_AT_data_member_location: (data2) 304
  <2><380>: Abbrev Number: 25 (DW_TAG_member)
-    <381>   DW_AT_name        : (strp) (offset: 0x285d): tp_new
+    <381>   DW_AT_name        : (strp) (offset: 0x2872): tp_new
     <385>   DW_AT_decl_file   : (data1) 12
     <386>   DW_AT_decl_line   : (data2) 259
     <388>   DW_AT_decl_column : (data1) 13
     <389>   DW_AT_type        : (ref4) <0x78d>, newfunc, PyObject, _object
     <38d>   DW_AT_data_member_location: (data2) 312
  <2><38f>: Abbrev Number: 25 (DW_TAG_member)
-    <390>   DW_AT_name        : (strp) (offset: 0xe9b): tp_free
+    <390>   DW_AT_name        : (strp) (offset: 0xeb0): tp_free
     <394>   DW_AT_decl_file   : (data1) 12
     <395>   DW_AT_decl_line   : (data2) 260
     <397>   DW_AT_decl_column : (data1) 14
     <398>   DW_AT_type        : (ref4) <0x656>, freefunc
     <39c>   DW_AT_data_member_location: (data2) 320
  <2><39e>: Abbrev Number: 25 (DW_TAG_member)
     <39f>   DW_AT_name        : (strp) (offset: 0x408): tp_is_gc
@@ -485,64 +485,64 @@
     <3ae>   DW_AT_name        : (strp) (offset: 0x699): tp_bases
     <3b2>   DW_AT_decl_file   : (data1) 12
     <3b3>   DW_AT_decl_line   : (data2) 262
     <3b5>   DW_AT_decl_column : (data1) 15
     <3b6>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
     <3ba>   DW_AT_data_member_location: (data2) 336
  <2><3bc>: Abbrev Number: 25 (DW_TAG_member)
-    <3bd>   DW_AT_name        : (strp) (offset: 0x30db): tp_mro
+    <3bd>   DW_AT_name        : (strp) (offset: 0x30f0): tp_mro
     <3c1>   DW_AT_decl_file   : (data1) 12
     <3c2>   DW_AT_decl_line   : (data2) 263
     <3c4>   DW_AT_decl_column : (data1) 15
     <3c5>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
     <3c9>   DW_AT_data_member_location: (data2) 344
  <2><3cb>: Abbrev Number: 25 (DW_TAG_member)
-    <3cc>   DW_AT_name        : (strp) (offset: 0x4aba): tp_cache
+    <3cc>   DW_AT_name        : (strp) (offset: 0x4ab8): tp_cache
     <3d0>   DW_AT_decl_file   : (data1) 12
     <3d1>   DW_AT_decl_line   : (data2) 264
     <3d3>   DW_AT_decl_column : (data1) 15
     <3d4>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
     <3d8>   DW_AT_data_member_location: (data2) 352
  <2><3da>: Abbrev Number: 25 (DW_TAG_member)
-    <3db>   DW_AT_name        : (strp) (offset: 0x41c2): tp_subclasses
+    <3db>   DW_AT_name        : (strp) (offset: 0x41da): tp_subclasses
     <3df>   DW_AT_decl_file   : (data1) 12
     <3e0>   DW_AT_decl_line   : (data2) 265
     <3e2>   DW_AT_decl_column : (data1) 15
     <3e3>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
     <3e7>   DW_AT_data_member_location: (data2) 360
  <2><3e9>: Abbrev Number: 25 (DW_TAG_member)
-    <3ea>   DW_AT_name        : (strp) (offset: 0x396c): tp_weaklist
+    <3ea>   DW_AT_name        : (strp) (offset: 0x3994): tp_weaklist
     <3ee>   DW_AT_decl_file   : (data1) 12
     <3ef>   DW_AT_decl_line   : (data2) 266
     <3f1>   DW_AT_decl_column : (data1) 15
     <3f2>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
     <3f6>   DW_AT_data_member_location: (data2) 368
  <2><3f8>: Abbrev Number: 25 (DW_TAG_member)
-    <3f9>   DW_AT_name        : (strp) (offset: 0x2abb): tp_del
+    <3f9>   DW_AT_name        : (strp) (offset: 0x2ad0): tp_del
     <3fd>   DW_AT_decl_file   : (data1) 12
     <3fe>   DW_AT_decl_line   : (data2) 267
     <400>   DW_AT_decl_column : (data1) 16
     <401>   DW_AT_type        : (ref4) <0x673>, destructor
     <405>   DW_AT_data_member_location: (data2) 376
  <2><407>: Abbrev Number: 25 (DW_TAG_member)
-    <408>   DW_AT_name        : (strp) (offset: 0x3d91): tp_version_tag
+    <408>   DW_AT_name        : (strp) (offset: 0x3da9): tp_version_tag
     <40c>   DW_AT_decl_file   : (data1) 12
     <40d>   DW_AT_decl_line   : (data2) 270
     <40f>   DW_AT_decl_column : (data1) 18
     <410>   DW_AT_type        : (ref4) <0x4f>, unsigned int
     <414>   DW_AT_data_member_location: (data2) 384
  <2><416>: Abbrev Number: 25 (DW_TAG_member)
-    <417>   DW_AT_name        : (strp) (offset: 0x1600): tp_finalize
+    <417>   DW_AT_name        : (strp) (offset: 0x1615): tp_finalize
     <41b>   DW_AT_decl_file   : (data1) 12
     <41c>   DW_AT_decl_line   : (data2) 272
     <41e>   DW_AT_decl_column : (data1) 16
     <41f>   DW_AT_type        : (ref4) <0x673>, destructor
     <423>   DW_AT_data_member_location: (data2) 392
  <2><425>: Abbrev Number: 25 (DW_TAG_member)
-    <426>   DW_AT_name        : (strp) (offset: 0x3d43): tp_vectorcall
+    <426>   DW_AT_name        : (strp) (offset: 0x3d5b): tp_vectorcall
     <42a>   DW_AT_decl_file   : (data1) 12
     <42b>   DW_AT_decl_line   : (data2) 273
     <42d>   DW_AT_decl_column : (data1) 20
     <42e>   DW_AT_type        : (ref4) <0x905>, vectorcallfunc, PyObject, _object
     <432>   DW_AT_data_member_location: (data2) 400
  <2><434>: Abbrev Number: 0
  <1><435>: Abbrev Number: 60 (DW_TAG_structure_type)
@@ -567,50 +567,50 @@
     <457>   DW_AT_type        : (ref4) <0x45d>, PyTypeObject, _typeobject
     <45b>   DW_AT_data_member_location: (data1) 8
  <2><45c>: Abbrev Number: 0
  <1><45d>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <45e>   DW_AT_byte_size   : (data1) 8
     <45f>   DW_AT_type        : (ref4) <0x176>, PyTypeObject, _typeobject
  <1><463>: Abbrev Number: 23 (DW_TAG_typedef)
-    <464>   DW_AT_name        : (strp) (offset: 0x2452): PyObject
+    <464>   DW_AT_name        : (strp) (offset: 0x2467): PyObject
     <468>   DW_AT_decl_file   : (data1) 2
     <469>   DW_AT_decl_line   : (data1) 109
     <46a>   DW_AT_decl_column : (data1) 3
     <46b>   DW_AT_type        : (ref4) <0x435>, _object
  <1><46f>: Abbrev Number: 39 (DW_TAG_const_type)
     <470>   DW_AT_type        : (ref4) <0x463>, PyObject, _object
  <1><474>: Abbrev Number: 52 (DW_TAG_structure_type)
     <475>   DW_AT_byte_size   : (data1) 24
     <476>   DW_AT_decl_file   : (data1) 2
     <477>   DW_AT_decl_line   : (data1) 115
     <478>   DW_AT_decl_column : (data1) 9
     <479>   DW_AT_sibling     : (ref4) <0x498>
  <2><47d>: Abbrev Number: 9 (DW_TAG_member)
-    <47e>   DW_AT_name        : (strp) (offset: 0x1212): ob_base
+    <47e>   DW_AT_name        : (strp) (offset: 0x1227): ob_base
     <482>   DW_AT_decl_file   : (data1) 2
     <483>   DW_AT_decl_line   : (data1) 116
     <484>   DW_AT_decl_column : (data1) 14
     <485>   DW_AT_type        : (ref4) <0x463>, PyObject, _object
     <489>   DW_AT_data_member_location: (data1) 0
  <2><48a>: Abbrev Number: 9 (DW_TAG_member)
-    <48b>   DW_AT_name        : (strp) (offset: 0x18f7): ob_size
+    <48b>   DW_AT_name        : (strp) (offset: 0x190c): ob_size
     <48f>   DW_AT_decl_file   : (data1) 2
     <490>   DW_AT_decl_line   : (data1) 117
     <491>   DW_AT_decl_column : (data1) 16
     <492>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <496>   DW_AT_data_member_location: (data1) 16
  <2><497>: Abbrev Number: 0
  <1><498>: Abbrev Number: 23 (DW_TAG_typedef)
-    <499>   DW_AT_name        : (strp) (offset: 0xf4e): PyVarObject
+    <499>   DW_AT_name        : (strp) (offset: 0xf63): PyVarObject
     <49d>   DW_AT_decl_file   : (data1) 2
     <49e>   DW_AT_decl_line   : (data1) 118
     <49f>   DW_AT_decl_column : (data1) 3
     <4a0>   DW_AT_type        : (ref4) <0x474>
  <1><4a4>: Abbrev Number: 23 (DW_TAG_typedef)
-    <4a5>   DW_AT_name        : (strp) (offset: 0x333e): unaryfunc
+    <4a5>   DW_AT_name        : (strp) (offset: 0x3353): unaryfunc
     <4a9>   DW_AT_decl_file   : (data1) 2
     <4aa>   DW_AT_decl_line   : (data1) 163
     <4ab>   DW_AT_decl_column : (data1) 22
     <4ac>   DW_AT_type        : (ref4) <0x4b0>, PyObject, _object
  <1><4b0>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <4b1>   DW_AT_byte_size   : (data1) 8
     <4b2>   DW_AT_type        : (ref4) <0x4b6>, PyObject, _object
@@ -623,15 +623,15 @@
  <2><4c4>: Abbrev Number: 0
  <1><4c5>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <4c6>   DW_AT_byte_size   : (data1) 8
     <4c7>   DW_AT_type        : (ref4) <0x463>, PyObject, _object
  <1><4cb>: Abbrev Number: 39 (DW_TAG_const_type)
     <4cc>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <1><4d0>: Abbrev Number: 23 (DW_TAG_typedef)
-    <4d1>   DW_AT_name        : (strp) (offset: 0x1b20): binaryfunc
+    <4d1>   DW_AT_name        : (strp) (offset: 0x1b35): binaryfunc
     <4d5>   DW_AT_decl_file   : (data1) 2
     <4d6>   DW_AT_decl_line   : (data1) 164
     <4d7>   DW_AT_decl_column : (data1) 22
     <4d8>   DW_AT_type        : (ref4) <0x4dc>, PyObject, _object
  <1><4dc>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <4dd>   DW_AT_byte_size   : (data1) 8
     <4de>   DW_AT_type        : (ref4) <0x4e2>, PyObject, _object
@@ -641,15 +641,15 @@
     <4e7>   DW_AT_sibling     : (ref4) <0x4f6>
  <2><4eb>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <4ec>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><4f0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <4f1>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><4f5>: Abbrev Number: 0
  <1><4f6>: Abbrev Number: 23 (DW_TAG_typedef)
-    <4f7>   DW_AT_name        : (strp) (offset: 0x11fc): ternaryfunc
+    <4f7>   DW_AT_name        : (strp) (offset: 0x1211): ternaryfunc
     <4fb>   DW_AT_decl_file   : (data1) 2
     <4fc>   DW_AT_decl_line   : (data1) 165
     <4fd>   DW_AT_decl_column : (data1) 22
     <4fe>   DW_AT_type        : (ref4) <0x502>, PyObject, _object
  <1><502>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <503>   DW_AT_byte_size   : (data1) 8
     <504>   DW_AT_type        : (ref4) <0x508>, PyObject, _object
@@ -661,15 +661,15 @@
     <512>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><516>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <517>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><51b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <51c>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><520>: Abbrev Number: 0
  <1><521>: Abbrev Number: 23 (DW_TAG_typedef)
-    <522>   DW_AT_name        : (strp) (offset: 0x34fa): inquiry
+    <522>   DW_AT_name        : (strp) (offset: 0x3522): inquiry
     <526>   DW_AT_decl_file   : (data1) 2
     <527>   DW_AT_decl_line   : (data1) 166
     <528>   DW_AT_decl_column : (data1) 15
     <529>   DW_AT_type        : (ref4) <0x52d>, int
  <1><52d>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <52e>   DW_AT_byte_size   : (data1) 8
     <52f>   DW_AT_type        : (ref4) <0x533>, int
@@ -693,15 +693,15 @@
     <555>   DW_AT_prototyped  : (flag_present) 1
     <555>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <559>   DW_AT_sibling     : (ref4) <0x563>
  <2><55d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <55e>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><562>: Abbrev Number: 0
  <1><563>: Abbrev Number: 23 (DW_TAG_typedef)
-    <564>   DW_AT_name        : (strp) (offset: 0x1d3c): ssizeargfunc
+    <564>   DW_AT_name        : (strp) (offset: 0x1d51): ssizeargfunc
     <568>   DW_AT_decl_file   : (data1) 2
     <569>   DW_AT_decl_line   : (data1) 168
     <56a>   DW_AT_decl_column : (data1) 21
     <56b>   DW_AT_type        : (ref4) <0x56f>, PyObject, _object
  <1><56f>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <570>   DW_AT_byte_size   : (data1) 8
     <571>   DW_AT_type        : (ref4) <0x575>, PyObject, _object
@@ -711,15 +711,15 @@
     <57a>   DW_AT_sibling     : (ref4) <0x589>
  <2><57e>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <57f>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><583>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <584>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><588>: Abbrev Number: 0
  <1><589>: Abbrev Number: 23 (DW_TAG_typedef)
-    <58a>   DW_AT_name        : (strp) (offset: 0x3cfd): ssizeobjargproc
+    <58a>   DW_AT_name        : (strp) (offset: 0x3d15): ssizeobjargproc
     <58e>   DW_AT_decl_file   : (data1) 2
     <58f>   DW_AT_decl_line   : (data1) 170
     <590>   DW_AT_decl_column : (data1) 14
     <591>   DW_AT_type        : (ref4) <0x595>, int
  <1><595>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <596>   DW_AT_byte_size   : (data1) 8
     <597>   DW_AT_type        : (ref4) <0x59b>, int
@@ -731,15 +731,15 @@
     <5a5>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><5a9>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <5aa>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><5ae>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <5af>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><5b3>: Abbrev Number: 0
  <1><5b4>: Abbrev Number: 23 (DW_TAG_typedef)
-    <5b5>   DW_AT_name        : (strp) (offset: 0x18e9): objobjargproc
+    <5b5>   DW_AT_name        : (strp) (offset: 0x18fe): objobjargproc
     <5b9>   DW_AT_decl_file   : (data1) 2
     <5ba>   DW_AT_decl_line   : (data1) 172
     <5bb>   DW_AT_decl_column : (data1) 14
     <5bc>   DW_AT_type        : (ref4) <0x5c0>, int
  <1><5c0>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <5c1>   DW_AT_byte_size   : (data1) 8
     <5c2>   DW_AT_type        : (ref4) <0x5c6>, int
@@ -751,15 +751,15 @@
     <5d0>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><5d4>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <5d5>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><5d9>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <5da>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><5de>: Abbrev Number: 0
  <1><5df>: Abbrev Number: 23 (DW_TAG_typedef)
-    <5e0>   DW_AT_name        : (strp) (offset: 0x5368): objobjproc
+    <5e0>   DW_AT_name        : (strp) (offset: 0x5366): objobjproc
     <5e4>   DW_AT_decl_file   : (data1) 2
     <5e5>   DW_AT_decl_line   : (data1) 174
     <5e6>   DW_AT_decl_column : (data1) 15
     <5e7>   DW_AT_type        : (ref4) <0x5eb>, int
  <1><5eb>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <5ec>   DW_AT_byte_size   : (data1) 8
     <5ed>   DW_AT_type        : (ref4) <0x5f1>, int
@@ -787,15 +787,15 @@
     <61c>   DW_AT_sibling     : (ref4) <0x62b>
  <2><620>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <621>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><625>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <626>   DW_AT_type        : (ref4) <0x7c>
  <2><62a>: Abbrev Number: 0
  <1><62b>: Abbrev Number: 23 (DW_TAG_typedef)
-    <62c>   DW_AT_name        : (strp) (offset: 0x348a): traverseproc
+    <62c>   DW_AT_name        : (strp) (offset: 0x34b2): traverseproc
     <630>   DW_AT_decl_file   : (data1) 2
     <631>   DW_AT_decl_line   : (data1) 176
     <632>   DW_AT_decl_column : (data1) 15
     <633>   DW_AT_type        : (ref4) <0x637>, int
  <1><637>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <638>   DW_AT_byte_size   : (data1) 8
     <639>   DW_AT_type        : (ref4) <0x63d>, int
@@ -807,45 +807,45 @@
     <647>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><64b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <64c>   DW_AT_type        : (ref4) <0x605>, visitproc, int
  <2><650>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <651>   DW_AT_type        : (ref4) <0x7c>
  <2><655>: Abbrev Number: 0
  <1><656>: Abbrev Number: 23 (DW_TAG_typedef)
-    <657>   DW_AT_name        : (strp) (offset: 0x4277): freefunc
+    <657>   DW_AT_name        : (strp) (offset: 0x428f): freefunc
     <65b>   DW_AT_decl_file   : (data1) 2
     <65c>   DW_AT_decl_line   : (data1) 179
     <65d>   DW_AT_decl_column : (data1) 16
     <65e>   DW_AT_type        : (ref4) <0x662>
  <1><662>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <663>   DW_AT_byte_size   : (data1) 8
     <664>   DW_AT_type        : (ref4) <0x668>
  <1><668>: Abbrev Number: 89 (DW_TAG_subroutine_type)
     <669>   DW_AT_prototyped  : (flag_present) 1
     <669>   DW_AT_sibling     : (ref4) <0x673>
  <2><66d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <66e>   DW_AT_type        : (ref4) <0x7c>
  <2><672>: Abbrev Number: 0
  <1><673>: Abbrev Number: 23 (DW_TAG_typedef)
-    <674>   DW_AT_name        : (strp) (offset: 0x299a): destructor
+    <674>   DW_AT_name        : (strp) (offset: 0x29af): destructor
     <678>   DW_AT_decl_file   : (data1) 2
     <679>   DW_AT_decl_line   : (data1) 180
     <67a>   DW_AT_decl_column : (data1) 16
     <67b>   DW_AT_type        : (ref4) <0x67f>
  <1><67f>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <680>   DW_AT_byte_size   : (data1) 8
     <681>   DW_AT_type        : (ref4) <0x685>
  <1><685>: Abbrev Number: 89 (DW_TAG_subroutine_type)
     <686>   DW_AT_prototyped  : (flag_present) 1
     <686>   DW_AT_sibling     : (ref4) <0x690>
  <2><68a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <68b>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><68f>: Abbrev Number: 0
  <1><690>: Abbrev Number: 23 (DW_TAG_typedef)
-    <691>   DW_AT_name        : (strp) (offset: 0x3a95): getattrfunc
+    <691>   DW_AT_name        : (strp) (offset: 0x3abd): getattrfunc
     <695>   DW_AT_decl_file   : (data1) 2
     <696>   DW_AT_decl_line   : (data1) 181
     <697>   DW_AT_decl_column : (data1) 21
     <698>   DW_AT_type        : (ref4) <0x69c>, PyObject, _object
  <1><69c>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <69d>   DW_AT_byte_size   : (data1) 8
     <69e>   DW_AT_type        : (ref4) <0x6a2>, PyObject, _object
@@ -855,21 +855,21 @@
     <6a7>   DW_AT_sibling     : (ref4) <0x6b6>
  <2><6ab>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <6ac>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><6b0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <6b1>   DW_AT_type        : (ref4) <0x8a>, char
  <2><6b5>: Abbrev Number: 0
  <1><6b6>: Abbrev Number: 23 (DW_TAG_typedef)
-    <6b7>   DW_AT_name        : (strp) (offset: 0x37da): getattrofunc
+    <6b7>   DW_AT_name        : (strp) (offset: 0x3802): getattrofunc
     <6bb>   DW_AT_decl_file   : (data1) 2
     <6bc>   DW_AT_decl_line   : (data1) 182
     <6bd>   DW_AT_decl_column : (data1) 21
     <6be>   DW_AT_type        : (ref4) <0x4dc>, PyObject, _object
  <1><6c2>: Abbrev Number: 23 (DW_TAG_typedef)
-    <6c3>   DW_AT_name        : (strp) (offset: 0x19c9): setattrfunc
+    <6c3>   DW_AT_name        : (strp) (offset: 0x19de): setattrfunc
     <6c7>   DW_AT_decl_file   : (data1) 2
     <6c8>   DW_AT_decl_line   : (data1) 183
     <6c9>   DW_AT_decl_column : (data1) 15
     <6ca>   DW_AT_type        : (ref4) <0x6ce>, int
  <1><6ce>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <6cf>   DW_AT_byte_size   : (data1) 8
     <6d0>   DW_AT_type        : (ref4) <0x6d4>, int
@@ -887,21 +887,21 @@
  <1><6ed>: Abbrev Number: 23 (DW_TAG_typedef)
     <6ee>   DW_AT_name        : (strp) (offset: 0x80b): setattrofunc
     <6f2>   DW_AT_decl_file   : (data1) 2
     <6f3>   DW_AT_decl_line   : (data1) 184
     <6f4>   DW_AT_decl_column : (data1) 15
     <6f5>   DW_AT_type        : (ref4) <0x5c0>, int
  <1><6f9>: Abbrev Number: 23 (DW_TAG_typedef)
-    <6fa>   DW_AT_name        : (strp) (offset: 0x20ed): reprfunc
+    <6fa>   DW_AT_name        : (strp) (offset: 0x2102): reprfunc
     <6fe>   DW_AT_decl_file   : (data1) 2
     <6ff>   DW_AT_decl_line   : (data1) 185
     <700>   DW_AT_decl_column : (data1) 21
     <701>   DW_AT_type        : (ref4) <0x4b0>, PyObject, _object
  <1><705>: Abbrev Number: 23 (DW_TAG_typedef)
-    <706>   DW_AT_name        : (strp) (offset: 0x3a8c): hashfunc
+    <706>   DW_AT_name        : (strp) (offset: 0x3ab4): hashfunc
     <70a>   DW_AT_decl_file   : (data1) 2
     <70b>   DW_AT_decl_line   : (data1) 186
     <70c>   DW_AT_decl_column : (data1) 21
     <70d>   DW_AT_type        : (ref4) <0x711>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><711>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <712>   DW_AT_byte_size   : (data1) 8
     <713>   DW_AT_type        : (ref4) <0x717>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
@@ -909,15 +909,15 @@
     <718>   DW_AT_prototyped  : (flag_present) 1
     <718>   DW_AT_type        : (ref4) <0x129>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <71c>   DW_AT_sibling     : (ref4) <0x726>
  <2><720>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <721>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><725>: Abbrev Number: 0
  <1><726>: Abbrev Number: 23 (DW_TAG_typedef)
-    <727>   DW_AT_name        : (strp) (offset: 0x14f3): richcmpfunc
+    <727>   DW_AT_name        : (strp) (offset: 0x1508): richcmpfunc
     <72b>   DW_AT_decl_file   : (data1) 2
     <72c>   DW_AT_decl_line   : (data1) 187
     <72d>   DW_AT_decl_column : (data1) 21
     <72e>   DW_AT_type        : (ref4) <0x732>, PyObject, _object
  <1><732>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <733>   DW_AT_byte_size   : (data1) 8
     <734>   DW_AT_type        : (ref4) <0x738>, PyObject, _object
@@ -929,45 +929,45 @@
     <742>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><746>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <747>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><74b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <74c>   DW_AT_type        : (ref4) <0x64>, int
  <2><750>: Abbrev Number: 0
  <1><751>: Abbrev Number: 23 (DW_TAG_typedef)
-    <752>   DW_AT_name        : (strp) (offset: 0x1d30): getiterfunc
+    <752>   DW_AT_name        : (strp) (offset: 0x1d45): getiterfunc
     <756>   DW_AT_decl_file   : (data1) 2
     <757>   DW_AT_decl_line   : (data1) 188
     <758>   DW_AT_decl_column : (data1) 21
     <759>   DW_AT_type        : (ref4) <0x4b0>, PyObject, _object
  <1><75d>: Abbrev Number: 23 (DW_TAG_typedef)
-    <75e>   DW_AT_name        : (strp) (offset: 0x50e0): iternextfunc
+    <75e>   DW_AT_name        : (strp) (offset: 0x50de): iternextfunc
     <762>   DW_AT_decl_file   : (data1) 2
     <763>   DW_AT_decl_line   : (data1) 189
     <764>   DW_AT_decl_column : (data1) 21
     <765>   DW_AT_type        : (ref4) <0x4b0>, PyObject, _object
  <1><769>: Abbrev Number: 23 (DW_TAG_typedef)
-    <76a>   DW_AT_name        : (strp) (offset: 0x1e9e): descrgetfunc
+    <76a>   DW_AT_name        : (strp) (offset: 0x1eb3): descrgetfunc
     <76e>   DW_AT_decl_file   : (data1) 2
     <76f>   DW_AT_decl_line   : (data1) 190
     <770>   DW_AT_decl_column : (data1) 21
     <771>   DW_AT_type        : (ref4) <0x502>, PyObject, _object
  <1><775>: Abbrev Number: 23 (DW_TAG_typedef)
-    <776>   DW_AT_name        : (strp) (offset: 0x1e25): descrsetfunc
+    <776>   DW_AT_name        : (strp) (offset: 0x1e3a): descrsetfunc
     <77a>   DW_AT_decl_file   : (data1) 2
     <77b>   DW_AT_decl_line   : (data1) 191
     <77c>   DW_AT_decl_column : (data1) 15
     <77d>   DW_AT_type        : (ref4) <0x5c0>, int
  <1><781>: Abbrev Number: 23 (DW_TAG_typedef)
     <782>   DW_AT_name        : (strp) (offset: 0x62c): initproc
     <786>   DW_AT_decl_file   : (data1) 2
     <787>   DW_AT_decl_line   : (data1) 192
     <788>   DW_AT_decl_column : (data1) 15
     <789>   DW_AT_type        : (ref4) <0x5c0>, int
  <1><78d>: Abbrev Number: 23 (DW_TAG_typedef)
-    <78e>   DW_AT_name        : (strp) (offset: 0x3a84): newfunc
+    <78e>   DW_AT_name        : (strp) (offset: 0x3aac): newfunc
     <792>   DW_AT_decl_file   : (data1) 2
     <793>   DW_AT_decl_line   : (data1) 193
     <794>   DW_AT_decl_column : (data1) 21
     <795>   DW_AT_type        : (ref4) <0x799>, PyObject, _object
  <1><799>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <79a>   DW_AT_byte_size   : (data1) 8
     <79b>   DW_AT_type        : (ref4) <0x79f>, PyObject, _object
@@ -979,15 +979,15 @@
     <7a9>   DW_AT_type        : (ref4) <0x45d>, PyTypeObject, _typeobject
  <2><7ad>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <7ae>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><7b2>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <7b3>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><7b7>: Abbrev Number: 0
  <1><7b8>: Abbrev Number: 23 (DW_TAG_typedef)
-    <7b9>   DW_AT_name        : (strp) (offset: 0x2fb4): allocfunc
+    <7b9>   DW_AT_name        : (strp) (offset: 0x2fc9): allocfunc
     <7bd>   DW_AT_decl_file   : (data1) 2
     <7be>   DW_AT_decl_line   : (data1) 194
     <7bf>   DW_AT_decl_column : (data1) 21
     <7c0>   DW_AT_type        : (ref4) <0x7c4>, PyObject, _object
  <1><7c4>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <7c5>   DW_AT_byte_size   : (data1) 8
     <7c6>   DW_AT_type        : (ref4) <0x7ca>, PyObject, _object
@@ -997,15 +997,15 @@
     <7cf>   DW_AT_sibling     : (ref4) <0x7de>
  <2><7d3>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <7d4>   DW_AT_type        : (ref4) <0x45d>, PyTypeObject, _typeobject
  <2><7d8>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <7d9>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><7dd>: Abbrev Number: 0
  <1><7de>: Abbrev Number: 45 (DW_TAG_variable)
-    <7df>   DW_AT_name        : (strp) (offset: 0x4f14): PyType_Type
+    <7df>   DW_AT_name        : (strp) (offset: 0x4f12): PyType_Type
     <7e3>   DW_AT_decl_file   : (data1) 2
     <7e4>   DW_AT_decl_line   : (data1) 227
     <7e5>   DW_AT_decl_column : (data1) 26
     <7e6>   DW_AT_type        : (ref4) <0x176>, PyTypeObject, _typeobject
     <7ea>   DW_AT_external    : (flag_present) 1
     <7ea>   DW_AT_declaration : (flag_present) 1
  <1><7ea>: Abbrev Number: 45 (DW_TAG_variable)
@@ -1013,23 +1013,23 @@
     <7ef>   DW_AT_decl_file   : (data1) 2
     <7f0>   DW_AT_decl_line   : (data1) 228
     <7f1>   DW_AT_decl_column : (data1) 26
     <7f2>   DW_AT_type        : (ref4) <0x176>, PyTypeObject, _typeobject
     <7f6>   DW_AT_external    : (flag_present) 1
     <7f6>   DW_AT_declaration : (flag_present) 1
  <1><7f6>: Abbrev Number: 98 (DW_TAG_variable)
-    <7f7>   DW_AT_name        : (strp) (offset: 0x4c63): _Py_NoneStruct
+    <7f7>   DW_AT_name        : (strp) (offset: 0x4c61): _Py_NoneStruct
     <7fb>   DW_AT_decl_file   : (data1) 2
     <7fc>   DW_AT_decl_line   : (data2) 516
     <7fe>   DW_AT_decl_column : (data1) 22
     <7ff>   DW_AT_type        : (ref4) <0x463>, PyObject, _object
     <803>   DW_AT_external    : (flag_present) 1
     <803>   DW_AT_declaration : (flag_present) 1
  <1><803>: Abbrev Number: 60 (DW_TAG_structure_type)
-    <804>   DW_AT_name        : (strp) (offset: 0x39a7): bufferinfo
+    <804>   DW_AT_name        : (strp) (offset: 0x39cf): bufferinfo
     <808>   DW_AT_byte_size   : (data1) 80
     <809>   DW_AT_decl_file   : (data1) 12
     <80a>   DW_AT_decl_line   : (data1) 56
     <80b>   DW_AT_decl_column : (data1) 16
     <80c>   DW_AT_sibling     : (ref4) <0x8a0>
  <2><810>: Abbrev Number: 69 (DW_TAG_member)
     <811>   DW_AT_name        : (string) buf
@@ -1056,74 +1056,74 @@
     <838>   DW_AT_name        : (strp) (offset: 0x560): itemsize
     <83c>   DW_AT_decl_file   : (data1) 12
     <83d>   DW_AT_decl_line   : (data1) 60
     <83e>   DW_AT_decl_column : (data1) 16
     <83f>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <843>   DW_AT_data_member_location: (data1) 24
  <2><844>: Abbrev Number: 9 (DW_TAG_member)
-    <845>   DW_AT_name        : (strp) (offset: 0x37ac): readonly
+    <845>   DW_AT_name        : (strp) (offset: 0x37d4): readonly
     <849>   DW_AT_decl_file   : (data1) 12
     <84a>   DW_AT_decl_line   : (data1) 62
     <84b>   DW_AT_decl_column : (data1) 9
     <84c>   DW_AT_type        : (ref4) <0x64>, int
     <850>   DW_AT_data_member_location: (data1) 32
  <2><851>: Abbrev Number: 9 (DW_TAG_member)
-    <852>   DW_AT_name        : (strp) (offset: 0x3cf8): ndim
+    <852>   DW_AT_name        : (strp) (offset: 0x3d10): ndim
     <856>   DW_AT_decl_file   : (data1) 12
     <857>   DW_AT_decl_line   : (data1) 63
     <858>   DW_AT_decl_column : (data1) 9
     <859>   DW_AT_type        : (ref4) <0x64>, int
     <85d>   DW_AT_data_member_location: (data1) 36
  <2><85e>: Abbrev Number: 9 (DW_TAG_member)
-    <85f>   DW_AT_name        : (strp) (offset: 0x3337): format
+    <85f>   DW_AT_name        : (strp) (offset: 0x334c): format
     <863>   DW_AT_decl_file   : (data1) 12
     <864>   DW_AT_decl_line   : (data1) 64
     <865>   DW_AT_decl_column : (data1) 11
     <866>   DW_AT_type        : (ref4) <0x8a>, char
     <86a>   DW_AT_data_member_location: (data1) 40
  <2><86b>: Abbrev Number: 9 (DW_TAG_member)
-    <86c>   DW_AT_name        : (strp) (offset: 0x3c7b): shape
+    <86c>   DW_AT_name        : (strp) (offset: 0x3c93): shape
     <870>   DW_AT_decl_file   : (data1) 12
     <871>   DW_AT_decl_line   : (data1) 65
     <872>   DW_AT_decl_column : (data1) 17
     <873>   DW_AT_type        : (ref4) <0x8a0>, Py_ssize_t, ssize_t, __ssize_t, long int
     <877>   DW_AT_data_member_location: (data1) 48
  <2><878>: Abbrev Number: 9 (DW_TAG_member)
-    <879>   DW_AT_name        : (strp) (offset: 0x44e5): strides
+    <879>   DW_AT_name        : (strp) (offset: 0x44e3): strides
     <87d>   DW_AT_decl_file   : (data1) 12
     <87e>   DW_AT_decl_line   : (data1) 66
     <87f>   DW_AT_decl_column : (data1) 17
     <880>   DW_AT_type        : (ref4) <0x8a0>, Py_ssize_t, ssize_t, __ssize_t, long int
     <884>   DW_AT_data_member_location: (data1) 56
  <2><885>: Abbrev Number: 9 (DW_TAG_member)
-    <886>   DW_AT_name        : (strp) (offset: 0x2dbc): suboffsets
+    <886>   DW_AT_name        : (strp) (offset: 0x2dd1): suboffsets
     <88a>   DW_AT_decl_file   : (data1) 12
     <88b>   DW_AT_decl_line   : (data1) 67
     <88c>   DW_AT_decl_column : (data1) 17
     <88d>   DW_AT_type        : (ref4) <0x8a0>, Py_ssize_t, ssize_t, __ssize_t, long int
     <891>   DW_AT_data_member_location: (data1) 64
  <2><892>: Abbrev Number: 9 (DW_TAG_member)
-    <893>   DW_AT_name        : (strp) (offset: 0x48ec): internal
+    <893>   DW_AT_name        : (strp) (offset: 0x48ea): internal
     <897>   DW_AT_decl_file   : (data1) 12
     <898>   DW_AT_decl_line   : (data1) 68
     <899>   DW_AT_decl_column : (data1) 11
     <89a>   DW_AT_type        : (ref4) <0x7c>
     <89e>   DW_AT_data_member_location: (data1) 72
  <2><89f>: Abbrev Number: 0
  <1><8a0>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <8a1>   DW_AT_byte_size   : (data1) 8
     <8a2>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><8a6>: Abbrev Number: 23 (DW_TAG_typedef)
-    <8a7>   DW_AT_name        : (strp) (offset: 0x51fc): Py_buffer
+    <8a7>   DW_AT_name        : (strp) (offset: 0x51fa): Py_buffer
     <8ab>   DW_AT_decl_file   : (data1) 12
     <8ac>   DW_AT_decl_line   : (data1) 69
     <8ad>   DW_AT_decl_column : (data1) 3
     <8ae>   DW_AT_type        : (ref4) <0x803>, bufferinfo
  <1><8b2>: Abbrev Number: 23 (DW_TAG_typedef)
-    <8b3>   DW_AT_name        : (strp) (offset: 0x3eb6): getbufferproc
+    <8b3>   DW_AT_name        : (strp) (offset: 0x3ece): getbufferproc
     <8b7>   DW_AT_decl_file   : (data1) 12
     <8b8>   DW_AT_decl_line   : (data1) 71
     <8b9>   DW_AT_decl_column : (data1) 15
     <8ba>   DW_AT_type        : (ref4) <0x8be>, int
  <1><8be>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <8bf>   DW_AT_byte_size   : (data1) 8
     <8c0>   DW_AT_type        : (ref4) <0x8c4>, int
@@ -1138,15 +1138,15 @@
  <2><8d7>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <8d8>   DW_AT_type        : (ref4) <0x64>, int
  <2><8dc>: Abbrev Number: 0
  <1><8dd>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <8de>   DW_AT_byte_size   : (data1) 8
     <8df>   DW_AT_type        : (ref4) <0x8a6>, Py_buffer, bufferinfo
  <1><8e3>: Abbrev Number: 23 (DW_TAG_typedef)
-    <8e4>   DW_AT_name        : (strp) (offset: 0x46db): releasebufferproc
+    <8e4>   DW_AT_name        : (strp) (offset: 0x46d9): releasebufferproc
     <8e8>   DW_AT_decl_file   : (data1) 12
     <8e9>   DW_AT_decl_line   : (data1) 72
     <8ea>   DW_AT_decl_column : (data1) 16
     <8eb>   DW_AT_type        : (ref4) <0x8ef>
  <1><8ef>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <8f0>   DW_AT_byte_size   : (data1) 8
     <8f1>   DW_AT_type        : (ref4) <0x8f5>
@@ -1155,15 +1155,15 @@
     <8f6>   DW_AT_sibling     : (ref4) <0x905>
  <2><8fa>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <8fb>   DW_AT_type        : (ref4) <0x4c5>, PyObject, _object
  <2><8ff>: Abbrev Number: 6 (DW_TAG_formal_parameter)
     <900>   DW_AT_type        : (ref4) <0x8dd>, Py_buffer, bufferinfo
  <2><904>: Abbrev Number: 0
  <1><905>: Abbrev Number: 23 (DW_TAG_typedef)
-    <906>   DW_AT_name        : (strp) (offset: 0x1ced): vectorcallfunc
+    <906>   DW_AT_name        : (strp) (offset: 0x1d02): vectorcallfunc
     <90a>   DW_AT_decl_file   : (data1) 12
     <90b>   DW_AT_decl_line   : (data1) 74
     <90c>   DW_AT_decl_column : (data1) 21
     <90d>   DW_AT_type        : (ref4) <0x911>, PyObject, _object
  <1><911>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <912>   DW_AT_byte_size   : (data1) 8
     <913>   DW_AT_type        : (ref4) <0x917>, PyObject, _object
@@ -1193,232 +1193,232 @@
     <946>   DW_AT_name        : (strp) (offset: 0x22c): nb_add
     <94a>   DW_AT_decl_file   : (data1) 12
     <94b>   DW_AT_decl_line   : (data1) 116
     <94c>   DW_AT_decl_column : (data1) 16
     <94d>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <951>   DW_AT_data_member_location: (data1) 0
  <2><952>: Abbrev Number: 9 (DW_TAG_member)
-    <953>   DW_AT_name        : (strp) (offset: 0x19bd): nb_subtract
+    <953>   DW_AT_name        : (strp) (offset: 0x19d2): nb_subtract
     <957>   DW_AT_decl_file   : (data1) 12
     <958>   DW_AT_decl_line   : (data1) 117
     <959>   DW_AT_decl_column : (data1) 16
     <95a>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <95e>   DW_AT_data_member_location: (data1) 8
  <2><95f>: Abbrev Number: 9 (DW_TAG_member)
-    <960>   DW_AT_name        : (strp) (offset: 0x42d9): nb_multiply
+    <960>   DW_AT_name        : (strp) (offset: 0x42f1): nb_multiply
     <964>   DW_AT_decl_file   : (data1) 12
     <965>   DW_AT_decl_line   : (data1) 118
     <966>   DW_AT_decl_column : (data1) 16
     <967>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <96b>   DW_AT_data_member_location: (data1) 16
  <2><96c>: Abbrev Number: 9 (DW_TAG_member)
     <96d>   DW_AT_name        : (strp) (offset: 0xc40): nb_remainder
     <971>   DW_AT_decl_file   : (data1) 12
     <972>   DW_AT_decl_line   : (data1) 119
     <973>   DW_AT_decl_column : (data1) 16
     <974>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <978>   DW_AT_data_member_location: (data1) 24
  <2><979>: Abbrev Number: 9 (DW_TAG_member)
-    <97a>   DW_AT_name        : (strp) (offset: 0x534f): nb_divmod
+    <97a>   DW_AT_name        : (strp) (offset: 0x534d): nb_divmod
     <97e>   DW_AT_decl_file   : (data1) 12
     <97f>   DW_AT_decl_line   : (data1) 120
     <980>   DW_AT_decl_column : (data1) 16
     <981>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <985>   DW_AT_data_member_location: (data1) 32
  <2><986>: Abbrev Number: 9 (DW_TAG_member)
     <987>   DW_AT_name        : (strp) (offset: 0x42b): nb_power
     <98b>   DW_AT_decl_file   : (data1) 12
     <98c>   DW_AT_decl_line   : (data1) 121
     <98d>   DW_AT_decl_column : (data1) 17
     <98e>   DW_AT_type        : (ref4) <0x4f6>, ternaryfunc, PyObject, _object
     <992>   DW_AT_data_member_location: (data1) 40
  <2><993>: Abbrev Number: 9 (DW_TAG_member)
-    <994>   DW_AT_name        : (strp) (offset: 0x249d): nb_negative
+    <994>   DW_AT_name        : (strp) (offset: 0x24b2): nb_negative
     <998>   DW_AT_decl_file   : (data1) 12
     <999>   DW_AT_decl_line   : (data1) 122
     <99a>   DW_AT_decl_column : (data1) 15
     <99b>   DW_AT_type        : (ref4) <0x4a4>, unaryfunc, PyObject, _object
     <99f>   DW_AT_data_member_location: (data1) 48
  <2><9a0>: Abbrev Number: 9 (DW_TAG_member)
-    <9a1>   DW_AT_name        : (strp) (offset: 0x4c16): nb_positive
+    <9a1>   DW_AT_name        : (strp) (offset: 0x4c14): nb_positive
     <9a5>   DW_AT_decl_file   : (data1) 12
     <9a6>   DW_AT_decl_line   : (data1) 123
     <9a7>   DW_AT_decl_column : (data1) 15
     <9a8>   DW_AT_type        : (ref4) <0x4a4>, unaryfunc, PyObject, _object
     <9ac>   DW_AT_data_member_location: (data1) 56
  <2><9ad>: Abbrev Number: 9 (DW_TAG_member)
-    <9ae>   DW_AT_name        : (strp) (offset: 0x4832): nb_absolute
+    <9ae>   DW_AT_name        : (strp) (offset: 0x4830): nb_absolute
     <9b2>   DW_AT_decl_file   : (data1) 12
     <9b3>   DW_AT_decl_line   : (data1) 124
     <9b4>   DW_AT_decl_column : (data1) 15
     <9b5>   DW_AT_type        : (ref4) <0x4a4>, unaryfunc, PyObject, _object
     <9b9>   DW_AT_data_member_location: (data1) 64
  <2><9ba>: Abbrev Number: 9 (DW_TAG_member)
-    <9bb>   DW_AT_name        : (strp) (offset: 0x17cf): nb_bool
+    <9bb>   DW_AT_name        : (strp) (offset: 0x17e4): nb_bool
     <9bf>   DW_AT_decl_file   : (data1) 12
     <9c0>   DW_AT_decl_line   : (data1) 125
     <9c1>   DW_AT_decl_column : (data1) 13
     <9c2>   DW_AT_type        : (ref4) <0x521>, inquiry, int
     <9c6>   DW_AT_data_member_location: (data1) 72
  <2><9c7>: Abbrev Number: 9 (DW_TAG_member)
-    <9c8>   DW_AT_name        : (strp) (offset: 0x3515): nb_invert
+    <9c8>   DW_AT_name        : (strp) (offset: 0x353d): nb_invert
     <9cc>   DW_AT_decl_file   : (data1) 12
     <9cd>   DW_AT_decl_line   : (data1) 126
     <9ce>   DW_AT_decl_column : (data1) 15
     <9cf>   DW_AT_type        : (ref4) <0x4a4>, unaryfunc, PyObject, _object
     <9d3>   DW_AT_data_member_location: (data1) 80
  <2><9d4>: Abbrev Number: 9 (DW_TAG_member)
     <9d5>   DW_AT_name        : (strp) (offset: 0x3a2): nb_lshift
     <9d9>   DW_AT_decl_file   : (data1) 12
     <9da>   DW_AT_decl_line   : (data1) 127
     <9db>   DW_AT_decl_column : (data1) 16
     <9dc>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <9e0>   DW_AT_data_member_location: (data1) 88
  <2><9e1>: Abbrev Number: 9 (DW_TAG_member)
-    <9e2>   DW_AT_name        : (strp) (offset: 0x452b): nb_rshift
+    <9e2>   DW_AT_name        : (strp) (offset: 0x4529): nb_rshift
     <9e6>   DW_AT_decl_file   : (data1) 12
     <9e7>   DW_AT_decl_line   : (data1) 128
     <9e8>   DW_AT_decl_column : (data1) 16
     <9e9>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <9ed>   DW_AT_data_member_location: (data1) 96
  <2><9ee>: Abbrev Number: 9 (DW_TAG_member)
-    <9ef>   DW_AT_name        : (strp) (offset: 0xfd4): nb_and
+    <9ef>   DW_AT_name        : (strp) (offset: 0xfe9): nb_and
     <9f3>   DW_AT_decl_file   : (data1) 12
     <9f4>   DW_AT_decl_line   : (data1) 129
     <9f5>   DW_AT_decl_column : (data1) 16
     <9f6>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <9fa>   DW_AT_data_member_location: (data1) 104
  <2><9fb>: Abbrev Number: 9 (DW_TAG_member)
-    <9fc>   DW_AT_name        : (strp) (offset: 0x2472): nb_xor
+    <9fc>   DW_AT_name        : (strp) (offset: 0x2487): nb_xor
     <a00>   DW_AT_decl_file   : (data1) 12
     <a01>   DW_AT_decl_line   : (data1) 130
     <a02>   DW_AT_decl_column : (data1) 16
     <a03>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <a07>   DW_AT_data_member_location: (data1) 112
  <2><a08>: Abbrev Number: 9 (DW_TAG_member)
-    <a09>   DW_AT_name        : (strp) (offset: 0x32f4): nb_or
+    <a09>   DW_AT_name        : (strp) (offset: 0x3309): nb_or
     <a0d>   DW_AT_decl_file   : (data1) 12
     <a0e>   DW_AT_decl_line   : (data1) 131
     <a0f>   DW_AT_decl_column : (data1) 16
     <a10>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <a14>   DW_AT_data_member_location: (data1) 120
  <2><a15>: Abbrev Number: 9 (DW_TAG_member)
-    <a16>   DW_AT_name        : (strp) (offset: 0x5158): nb_int
+    <a16>   DW_AT_name        : (strp) (offset: 0x5156): nb_int
     <a1a>   DW_AT_decl_file   : (data1) 12
     <a1b>   DW_AT_decl_line   : (data1) 132
     <a1c>   DW_AT_decl_column : (data1) 15
     <a1d>   DW_AT_type        : (ref4) <0x4a4>, unaryfunc, PyObject, _object
     <a21>   DW_AT_data_member_location: (data1) 128
  <2><a22>: Abbrev Number: 9 (DW_TAG_member)
-    <a23>   DW_AT_name        : (strp) (offset: 0x1f2c): nb_reserved
+    <a23>   DW_AT_name        : (strp) (offset: 0x1f41): nb_reserved
     <a27>   DW_AT_decl_file   : (data1) 12
     <a28>   DW_AT_decl_line   : (data1) 133
     <a29>   DW_AT_decl_column : (data1) 11
     <a2a>   DW_AT_type        : (ref4) <0x7c>
     <a2e>   DW_AT_data_member_location: (data1) 136
  <2><a2f>: Abbrev Number: 9 (DW_TAG_member)
-    <a30>   DW_AT_name        : (strp) (offset: 0x33fb): nb_float
+    <a30>   DW_AT_name        : (strp) (offset: 0x3410): nb_float
     <a34>   DW_AT_decl_file   : (data1) 12
     <a35>   DW_AT_decl_line   : (data1) 134
     <a36>   DW_AT_decl_column : (data1) 15
     <a37>   DW_AT_type        : (ref4) <0x4a4>, unaryfunc, PyObject, _object
     <a3b>   DW_AT_data_member_location: (data1) 144
  <2><a3c>: Abbrev Number: 9 (DW_TAG_member)
-    <a3d>   DW_AT_name        : (strp) (offset: 0x1f08): nb_inplace_add
+    <a3d>   DW_AT_name        : (strp) (offset: 0x1f1d): nb_inplace_add
     <a41>   DW_AT_decl_file   : (data1) 12
     <a42>   DW_AT_decl_line   : (data1) 136
     <a43>   DW_AT_decl_column : (data1) 16
     <a44>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <a48>   DW_AT_data_member_location: (data1) 152
  <2><a49>: Abbrev Number: 9 (DW_TAG_member)
-    <a4a>   DW_AT_name        : (strp) (offset: 0x52c6): nb_inplace_subtract
+    <a4a>   DW_AT_name        : (strp) (offset: 0x52c4): nb_inplace_subtract
     <a4e>   DW_AT_decl_file   : (data1) 12
     <a4f>   DW_AT_decl_line   : (data1) 137
     <a50>   DW_AT_decl_column : (data1) 16
     <a51>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <a55>   DW_AT_data_member_location: (data1) 160
  <2><a56>: Abbrev Number: 9 (DW_TAG_member)
-    <a57>   DW_AT_name        : (strp) (offset: 0x46c7): nb_inplace_multiply
+    <a57>   DW_AT_name        : (strp) (offset: 0x46c5): nb_inplace_multiply
     <a5b>   DW_AT_decl_file   : (data1) 12
     <a5c>   DW_AT_decl_line   : (data1) 138
     <a5d>   DW_AT_decl_column : (data1) 16
     <a5e>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <a62>   DW_AT_data_member_location: (data1) 168
  <2><a63>: Abbrev Number: 9 (DW_TAG_member)
-    <a64>   DW_AT_name        : (strp) (offset: 0x471b): nb_inplace_remainder
+    <a64>   DW_AT_name        : (strp) (offset: 0x4719): nb_inplace_remainder
     <a68>   DW_AT_decl_file   : (data1) 12
     <a69>   DW_AT_decl_line   : (data1) 139
     <a6a>   DW_AT_decl_column : (data1) 16
     <a6b>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <a6f>   DW_AT_data_member_location: (data1) 176
  <2><a70>: Abbrev Number: 9 (DW_TAG_member)
-    <a71>   DW_AT_name        : (strp) (offset: 0x41d0): nb_inplace_power
+    <a71>   DW_AT_name        : (strp) (offset: 0x41e8): nb_inplace_power
     <a75>   DW_AT_decl_file   : (data1) 12
     <a76>   DW_AT_decl_line   : (data1) 140
     <a77>   DW_AT_decl_column : (data1) 17
     <a78>   DW_AT_type        : (ref4) <0x4f6>, ternaryfunc, PyObject, _object
     <a7c>   DW_AT_data_member_location: (data1) 184
  <2><a7d>: Abbrev Number: 9 (DW_TAG_member)
     <a7e>   DW_AT_name        : (strp) (offset: 0x991): nb_inplace_lshift
     <a82>   DW_AT_decl_file   : (data1) 12
     <a83>   DW_AT_decl_line   : (data1) 141
     <a84>   DW_AT_decl_column : (data1) 16
     <a85>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <a89>   DW_AT_data_member_location: (data1) 192
  <2><a8a>: Abbrev Number: 9 (DW_TAG_member)
-    <a8b>   DW_AT_name        : (strp) (offset: 0x4b6e): nb_inplace_rshift
+    <a8b>   DW_AT_name        : (strp) (offset: 0x4b6c): nb_inplace_rshift
     <a8f>   DW_AT_decl_file   : (data1) 12
     <a90>   DW_AT_decl_line   : (data1) 142
     <a91>   DW_AT_decl_column : (data1) 16
     <a92>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <a96>   DW_AT_data_member_location: (data1) 200
  <2><a97>: Abbrev Number: 9 (DW_TAG_member)
-    <a98>   DW_AT_name        : (strp) (offset: 0x2c87): nb_inplace_and
+    <a98>   DW_AT_name        : (strp) (offset: 0x2c9c): nb_inplace_and
     <a9c>   DW_AT_decl_file   : (data1) 12
     <a9d>   DW_AT_decl_line   : (data1) 143
     <a9e>   DW_AT_decl_column : (data1) 16
     <a9f>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <aa3>   DW_AT_data_member_location: (data1) 208
  <2><aa4>: Abbrev Number: 9 (DW_TAG_member)
-    <aa5>   DW_AT_name        : (strp) (offset: 0x4164): nb_inplace_xor
+    <aa5>   DW_AT_name        : (strp) (offset: 0x417c): nb_inplace_xor
     <aa9>   DW_AT_decl_file   : (data1) 12
     <aaa>   DW_AT_decl_line   : (data1) 144
     <aab>   DW_AT_decl_column : (data1) 16
     <aac>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <ab0>   DW_AT_data_member_location: (data1) 216
  <2><ab1>: Abbrev Number: 9 (DW_TAG_member)
-    <ab2>   DW_AT_name        : (strp) (offset: 0x49c6): nb_inplace_or
+    <ab2>   DW_AT_name        : (strp) (offset: 0x49c4): nb_inplace_or
     <ab6>   DW_AT_decl_file   : (data1) 12
     <ab7>   DW_AT_decl_line   : (data1) 145
     <ab8>   DW_AT_decl_column : (data1) 16
     <ab9>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <abd>   DW_AT_data_member_location: (data1) 224
  <2><abe>: Abbrev Number: 9 (DW_TAG_member)
     <abf>   DW_AT_name        : (strp) (offset: 0x952): nb_floor_divide
     <ac3>   DW_AT_decl_file   : (data1) 12
     <ac4>   DW_AT_decl_line   : (data1) 147
     <ac5>   DW_AT_decl_column : (data1) 16
     <ac6>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <aca>   DW_AT_data_member_location: (data1) 232
  <2><acb>: Abbrev Number: 9 (DW_TAG_member)
-    <acc>   DW_AT_name        : (strp) (offset: 0x4305): nb_true_divide
+    <acc>   DW_AT_name        : (strp) (offset: 0x431d): nb_true_divide
     <ad0>   DW_AT_decl_file   : (data1) 12
     <ad1>   DW_AT_decl_line   : (data1) 148
     <ad2>   DW_AT_decl_column : (data1) 16
     <ad3>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <ad7>   DW_AT_data_member_location: (data1) 240
  <2><ad8>: Abbrev Number: 9 (DW_TAG_member)
-    <ad9>   DW_AT_name        : (strp) (offset: 0x4484): nb_inplace_floor_divide
+    <ad9>   DW_AT_name        : (strp) (offset: 0x4482): nb_inplace_floor_divide
     <add>   DW_AT_decl_file   : (data1) 12
     <ade>   DW_AT_decl_line   : (data1) 149
     <adf>   DW_AT_decl_column : (data1) 16
     <ae0>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <ae4>   DW_AT_data_member_location: (data1) 248
  <2><ae5>: Abbrev Number: 64 (DW_TAG_member)
-    <ae6>   DW_AT_name        : (strp) (offset: 0x2943): nb_inplace_true_divide
+    <ae6>   DW_AT_name        : (strp) (offset: 0x2958): nb_inplace_true_divide
     <aea>   DW_AT_decl_file   : (data1) 12
     <aeb>   DW_AT_decl_line   : (data1) 150
     <aec>   DW_AT_decl_column : (data1) 16
     <aed>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <af1>   DW_AT_data_member_location: (data2) 256
  <2><af3>: Abbrev Number: 64 (DW_TAG_member)
     <af4>   DW_AT_name        : (strp) (offset: 0xb65): nb_index
@@ -1431,35 +1431,35 @@
     <b02>   DW_AT_name        : (strp) (offset: 0x37c): nb_matrix_multiply
     <b06>   DW_AT_decl_file   : (data1) 12
     <b07>   DW_AT_decl_line   : (data1) 154
     <b08>   DW_AT_decl_column : (data1) 16
     <b09>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <b0d>   DW_AT_data_member_location: (data2) 272
  <2><b0f>: Abbrev Number: 64 (DW_TAG_member)
-    <b10>   DW_AT_name        : (strp) (offset: 0x529e): nb_inplace_matrix_multiply
+    <b10>   DW_AT_name        : (strp) (offset: 0x529c): nb_inplace_matrix_multiply
     <b14>   DW_AT_decl_file   : (data1) 12
     <b15>   DW_AT_decl_line   : (data1) 155
     <b16>   DW_AT_decl_column : (data1) 16
     <b17>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <b1b>   DW_AT_data_member_location: (data2) 280
  <2><b1d>: Abbrev Number: 0
  <1><b1e>: Abbrev Number: 23 (DW_TAG_typedef)
-    <b1f>   DW_AT_name        : (strp) (offset: 0x15da): PyNumberMethods
+    <b1f>   DW_AT_name        : (strp) (offset: 0x15ef): PyNumberMethods
     <b23>   DW_AT_decl_file   : (data1) 12
     <b24>   DW_AT_decl_line   : (data1) 156
     <b25>   DW_AT_decl_column : (data1) 3
     <b26>   DW_AT_type        : (ref4) <0x93b>
  <1><b2a>: Abbrev Number: 52 (DW_TAG_structure_type)
     <b2b>   DW_AT_byte_size   : (data1) 80
     <b2c>   DW_AT_decl_file   : (data1) 12
     <b2d>   DW_AT_decl_line   : (data1) 158
     <b2e>   DW_AT_decl_column : (data1) 9
     <b2f>   DW_AT_sibling     : (ref4) <0xbb6>
  <2><b33>: Abbrev Number: 9 (DW_TAG_member)
-    <b34>   DW_AT_name        : (strp) (offset: 0x4397): sq_length
+    <b34>   DW_AT_name        : (strp) (offset: 0x4395): sq_length
     <b38>   DW_AT_decl_file   : (data1) 12
     <b39>   DW_AT_decl_line   : (data1) 159
     <b3a>   DW_AT_decl_column : (data1) 13
     <b3b>   DW_AT_type        : (ref4) <0x542>, lenfunc, Py_ssize_t, ssize_t, __ssize_t, long int
     <b3f>   DW_AT_data_member_location: (data1) 0
  <2><b40>: Abbrev Number: 9 (DW_TAG_member)
     <b41>   DW_AT_name        : (strp) (offset: 0x5c0): sq_concat
@@ -1493,22 +1493,22 @@
     <b75>   DW_AT_name        : (strp) (offset: 0x2b4): sq_ass_item
     <b79>   DW_AT_decl_file   : (data1) 12
     <b7a>   DW_AT_decl_line   : (data1) 164
     <b7b>   DW_AT_decl_column : (data1) 21
     <b7c>   DW_AT_type        : (ref4) <0x589>, ssizeobjargproc, int
     <b80>   DW_AT_data_member_location: (data1) 40
  <2><b81>: Abbrev Number: 9 (DW_TAG_member)
-    <b82>   DW_AT_name        : (strp) (offset: 0x116d): was_sq_ass_slice
+    <b82>   DW_AT_name        : (strp) (offset: 0x1182): was_sq_ass_slice
     <b86>   DW_AT_decl_file   : (data1) 12
     <b87>   DW_AT_decl_line   : (data1) 165
     <b88>   DW_AT_decl_column : (data1) 11
     <b89>   DW_AT_type        : (ref4) <0x7c>
     <b8d>   DW_AT_data_member_location: (data1) 48
  <2><b8e>: Abbrev Number: 9 (DW_TAG_member)
-    <b8f>   DW_AT_name        : (strp) (offset: 0x13bf): sq_contains
+    <b8f>   DW_AT_name        : (strp) (offset: 0x13d4): sq_contains
     <b93>   DW_AT_decl_file   : (data1) 12
     <b94>   DW_AT_decl_line   : (data1) 166
     <b95>   DW_AT_decl_column : (data1) 16
     <b96>   DW_AT_type        : (ref4) <0x5df>, objobjproc, int
     <b9a>   DW_AT_data_member_location: (data1) 56
  <2><b9b>: Abbrev Number: 9 (DW_TAG_member)
     <b9c>   DW_AT_name        : (strp) (offset: 0x3ee): sq_inplace_concat
@@ -1522,110 +1522,110 @@
     <bad>   DW_AT_decl_file   : (data1) 12
     <bae>   DW_AT_decl_line   : (data1) 169
     <baf>   DW_AT_decl_column : (data1) 18
     <bb0>   DW_AT_type        : (ref4) <0x563>, ssizeargfunc, PyObject, _object
     <bb4>   DW_AT_data_member_location: (data1) 72
  <2><bb5>: Abbrev Number: 0
  <1><bb6>: Abbrev Number: 23 (DW_TAG_typedef)
-    <bb7>   DW_AT_name        : (strp) (offset: 0x2ec7): PySequenceMethods
+    <bb7>   DW_AT_name        : (strp) (offset: 0x2edc): PySequenceMethods
     <bbb>   DW_AT_decl_file   : (data1) 12
     <bbc>   DW_AT_decl_line   : (data1) 170
     <bbd>   DW_AT_decl_column : (data1) 3
     <bbe>   DW_AT_type        : (ref4) <0xb2a>
  <1><bc2>: Abbrev Number: 52 (DW_TAG_structure_type)
     <bc3>   DW_AT_byte_size   : (data1) 24
     <bc4>   DW_AT_decl_file   : (data1) 12
     <bc5>   DW_AT_decl_line   : (data1) 172
     <bc6>   DW_AT_decl_column : (data1) 9
     <bc7>   DW_AT_sibling     : (ref4) <0xbf3>
  <2><bcb>: Abbrev Number: 9 (DW_TAG_member)
-    <bcc>   DW_AT_name        : (strp) (offset: 0x4045): mp_length
+    <bcc>   DW_AT_name        : (strp) (offset: 0x405d): mp_length
     <bd0>   DW_AT_decl_file   : (data1) 12
     <bd1>   DW_AT_decl_line   : (data1) 173
     <bd2>   DW_AT_decl_column : (data1) 13
     <bd3>   DW_AT_type        : (ref4) <0x542>, lenfunc, Py_ssize_t, ssize_t, __ssize_t, long int
     <bd7>   DW_AT_data_member_location: (data1) 0
  <2><bd8>: Abbrev Number: 9 (DW_TAG_member)
-    <bd9>   DW_AT_name        : (strp) (offset: 0x1679): mp_subscript
+    <bd9>   DW_AT_name        : (strp) (offset: 0x168e): mp_subscript
     <bdd>   DW_AT_decl_file   : (data1) 12
     <bde>   DW_AT_decl_line   : (data1) 174
     <bdf>   DW_AT_decl_column : (data1) 16
     <be0>   DW_AT_type        : (ref4) <0x4d0>, binaryfunc, PyObject, _object
     <be4>   DW_AT_data_member_location: (data1) 8
  <2><be5>: Abbrev Number: 9 (DW_TAG_member)
-    <be6>   DW_AT_name        : (strp) (offset: 0x150d): mp_ass_subscript
+    <be6>   DW_AT_name        : (strp) (offset: 0x1522): mp_ass_subscript
     <bea>   DW_AT_decl_file   : (data1) 12
     <beb>   DW_AT_decl_line   : (data1) 175
     <bec>   DW_AT_decl_column : (data1) 19
     <bed>   DW_AT_type        : (ref4) <0x5b4>, objobjargproc, int
     <bf1>   DW_AT_data_member_location: (data1) 16
  <2><bf2>: Abbrev Number: 0
  <1><bf3>: Abbrev Number: 23 (DW_TAG_typedef)
-    <bf4>   DW_AT_name        : (strp) (offset: 0x4c8e): PyMappingMethods
+    <bf4>   DW_AT_name        : (strp) (offset: 0x4c8c): PyMappingMethods
     <bf8>   DW_AT_decl_file   : (data1) 12
     <bf9>   DW_AT_decl_line   : (data1) 176
     <bfa>   DW_AT_decl_column : (data1) 3
     <bfb>   DW_AT_type        : (ref4) <0xbc2>
  <1><bff>: Abbrev Number: 52 (DW_TAG_structure_type)
     <c00>   DW_AT_byte_size   : (data1) 24
     <c01>   DW_AT_decl_file   : (data1) 12
     <c02>   DW_AT_decl_line   : (data1) 178
     <c03>   DW_AT_decl_column : (data1) 9
     <c04>   DW_AT_sibling     : (ref4) <0xc30>
  <2><c08>: Abbrev Number: 9 (DW_TAG_member)
-    <c09>   DW_AT_name        : (strp) (offset: 0x3f1c): am_await
+    <c09>   DW_AT_name        : (strp) (offset: 0x3f34): am_await
     <c0d>   DW_AT_decl_file   : (data1) 12
     <c0e>   DW_AT_decl_line   : (data1) 179
     <c0f>   DW_AT_decl_column : (data1) 15
     <c10>   DW_AT_type        : (ref4) <0x4a4>, unaryfunc, PyObject, _object
     <c14>   DW_AT_data_member_location: (data1) 0
  <2><c15>: Abbrev Number: 9 (DW_TAG_member)
-    <c16>   DW_AT_name        : (strp) (offset: 0x412f): am_aiter
+    <c16>   DW_AT_name        : (strp) (offset: 0x4147): am_aiter
     <c1a>   DW_AT_decl_file   : (data1) 12
     <c1b>   DW_AT_decl_line   : (data1) 180
     <c1c>   DW_AT_decl_column : (data1) 15
     <c1d>   DW_AT_type        : (ref4) <0x4a4>, unaryfunc, PyObject, _object
     <c21>   DW_AT_data_member_location: (data1) 8
  <2><c22>: Abbrev Number: 9 (DW_TAG_member)
     <c23>   DW_AT_name        : (strp) (offset: 0x4c2): am_anext
     <c27>   DW_AT_decl_file   : (data1) 12
     <c28>   DW_AT_decl_line   : (data1) 181
     <c29>   DW_AT_decl_column : (data1) 15
     <c2a>   DW_AT_type        : (ref4) <0x4a4>, unaryfunc, PyObject, _object
     <c2e>   DW_AT_data_member_location: (data1) 16
  <2><c2f>: Abbrev Number: 0
  <1><c30>: Abbrev Number: 23 (DW_TAG_typedef)
-    <c31>   DW_AT_name        : (strp) (offset: 0x3692): PyAsyncMethods
+    <c31>   DW_AT_name        : (strp) (offset: 0x36ba): PyAsyncMethods
     <c35>   DW_AT_decl_file   : (data1) 12
     <c36>   DW_AT_decl_line   : (data1) 182
     <c37>   DW_AT_decl_column : (data1) 3
     <c38>   DW_AT_type        : (ref4) <0xbff>
  <1><c3c>: Abbrev Number: 52 (DW_TAG_structure_type)
     <c3d>   DW_AT_byte_size   : (data1) 16
     <c3e>   DW_AT_decl_file   : (data1) 12
     <c3f>   DW_AT_decl_line   : (data1) 184
     <c40>   DW_AT_decl_column : (data1) 9
     <c41>   DW_AT_sibling     : (ref4) <0xc60>
  <2><c45>: Abbrev Number: 9 (DW_TAG_member)
-    <c46>   DW_AT_name        : (strp) (offset: 0x1cc5): bf_getbuffer
+    <c46>   DW_AT_name        : (strp) (offset: 0x1cda): bf_getbuffer
     <c4a>   DW_AT_decl_file   : (data1) 12
     <c4b>   DW_AT_decl_line   : (data1) 185
     <c4c>   DW_AT_decl_column : (data1) 20
     <c4d>   DW_AT_type        : (ref4) <0x8b2>, getbufferproc, int
     <c51>   DW_AT_data_member_location: (data1) 0
  <2><c52>: Abbrev Number: 9 (DW_TAG_member)
-    <c53>   DW_AT_name        : (strp) (offset: 0x4641): bf_releasebuffer
+    <c53>   DW_AT_name        : (strp) (offset: 0x463f): bf_releasebuffer
     <c57>   DW_AT_decl_file   : (data1) 12
     <c58>   DW_AT_decl_line   : (data1) 186
     <c59>   DW_AT_decl_column : (data1) 24
     <c5a>   DW_AT_type        : (ref4) <0x8e3>, releasebufferproc
     <c5e>   DW_AT_data_member_location: (data1) 8
  <2><c5f>: Abbrev Number: 0
  <1><c60>: Abbrev Number: 23 (DW_TAG_typedef)
-    <c61>   DW_AT_name        : (strp) (offset: 0x27ef): PyBufferProcs
+    <c61>   DW_AT_name        : (strp) (offset: 0x2804): PyBufferProcs
     <c65>   DW_AT_decl_file   : (data1) 12
     <c66>   DW_AT_decl_line   : (data1) 187
     <c67>   DW_AT_decl_column : (data1) 3
     <c68>   DW_AT_type        : (ref4) <0xc3c>
  <1><c6c>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <c6d>   DW_AT_byte_size   : (data1) 8
     <c6e>   DW_AT_type        : (ref4) <0xc30>, PyAsyncMethods
@@ -1638,43 +1638,43 @@
  <1><c7e>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <c7f>   DW_AT_byte_size   : (data1) 8
     <c80>   DW_AT_type        : (ref4) <0xbf3>, PyMappingMethods
  <1><c84>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <c85>   DW_AT_byte_size   : (data1) 8
     <c86>   DW_AT_type        : (ref4) <0xc60>, PyBufferProcs
  <1><c8a>: Abbrev Number: 60 (DW_TAG_structure_type)
-    <c8b>   DW_AT_name        : (strp) (offset: 0x15f4): PyMethodDef
+    <c8b>   DW_AT_name        : (strp) (offset: 0x1609): PyMethodDef
     <c8f>   DW_AT_byte_size   : (data1) 32
     <c90>   DW_AT_decl_file   : (data1) 13
     <c91>   DW_AT_decl_line   : (data1) 35
     <c92>   DW_AT_decl_column : (data1) 8
     <c93>   DW_AT_sibling     : (ref4) <0xccc>
  <2><c97>: Abbrev Number: 9 (DW_TAG_member)
-    <c98>   DW_AT_name        : (strp) (offset: 0x3565): ml_name
+    <c98>   DW_AT_name        : (strp) (offset: 0x358d): ml_name
     <c9c>   DW_AT_decl_file   : (data1) 13
     <c9d>   DW_AT_decl_line   : (data1) 36
     <c9e>   DW_AT_decl_column : (data1) 18
     <c9f>   DW_AT_type        : (ref4) <0x9c>, char
     <ca3>   DW_AT_data_member_location: (data1) 0
  <2><ca4>: Abbrev Number: 9 (DW_TAG_member)
-    <ca5>   DW_AT_name        : (strp) (offset: 0x3759): ml_meth
+    <ca5>   DW_AT_name        : (strp) (offset: 0x3781): ml_meth
     <ca9>   DW_AT_decl_file   : (data1) 13
     <caa>   DW_AT_decl_line   : (data1) 37
     <cab>   DW_AT_decl_column : (data1) 17
     <cac>   DW_AT_type        : (ref4) <0x10e9>, PyCFunction, PyObject, _object
     <cb0>   DW_AT_data_member_location: (data1) 8
  <2><cb1>: Abbrev Number: 9 (DW_TAG_member)
-    <cb2>   DW_AT_name        : (strp) (offset: 0x2854): ml_flags
+    <cb2>   DW_AT_name        : (strp) (offset: 0x2869): ml_flags
     <cb6>   DW_AT_decl_file   : (data1) 13
     <cb7>   DW_AT_decl_line   : (data1) 38
     <cb8>   DW_AT_decl_column : (data1) 17
     <cb9>   DW_AT_type        : (ref4) <0x64>, int
     <cbd>   DW_AT_data_member_location: (data1) 16
  <2><cbe>: Abbrev Number: 9 (DW_TAG_member)
-    <cbf>   DW_AT_name        : (strp) (offset: 0x355e): ml_doc
+    <cbf>   DW_AT_name        : (strp) (offset: 0x3586): ml_doc
     <cc3>   DW_AT_decl_file   : (data1) 13
     <cc4>   DW_AT_decl_line   : (data1) 40
     <cc5>   DW_AT_decl_column : (data1) 18
     <cc6>   DW_AT_type        : (ref4) <0x9c>, char
     <cca>   DW_AT_data_member_location: (data1) 24
  <2><ccb>: Abbrev Number: 0
  <1><ccc>: Abbrev Number: 24 (DW_TAG_pointer_type)
@@ -1684,29 +1684,29 @@
     <cd3>   DW_AT_name        : (strp) (offset: 0xdfd): PyMemberDef
     <cd7>   DW_AT_byte_size   : (data1) 40
     <cd8>   DW_AT_decl_file   : (data1) 14
     <cd9>   DW_AT_decl_line   : (data1) 18
     <cda>   DW_AT_decl_column : (data1) 16
     <cdb>   DW_AT_sibling     : (ref4) <0xd21>
  <2><cdf>: Abbrev Number: 9 (DW_TAG_member)
-    <ce0>   DW_AT_name        : (strp) (offset: 0x1bea): name
+    <ce0>   DW_AT_name        : (strp) (offset: 0x1bff): name
     <ce4>   DW_AT_decl_file   : (data1) 14
     <ce5>   DW_AT_decl_line   : (data1) 19
     <ce6>   DW_AT_decl_column : (data1) 17
     <ce7>   DW_AT_type        : (ref4) <0x9c>, char
     <ceb>   DW_AT_data_member_location: (data1) 0
  <2><cec>: Abbrev Number: 9 (DW_TAG_member)
     <ced>   DW_AT_name        : (strp) (offset: 0xe67): type
     <cf1>   DW_AT_decl_file   : (data1) 14
     <cf2>   DW_AT_decl_line   : (data1) 20
     <cf3>   DW_AT_decl_column : (data1) 9
     <cf4>   DW_AT_type        : (ref4) <0x64>, int
     <cf8>   DW_AT_data_member_location: (data1) 8
  <2><cf9>: Abbrev Number: 9 (DW_TAG_member)
-    <cfa>   DW_AT_name        : (strp) (offset: 0x34e4): offset
+    <cfa>   DW_AT_name        : (strp) (offset: 0x350c): offset
     <cfe>   DW_AT_decl_file   : (data1) 14
     <cff>   DW_AT_decl_line   : (data1) 21
     <d00>   DW_AT_decl_column : (data1) 16
     <d01>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <d05>   DW_AT_data_member_location: (data1) 16
  <2><d06>: Abbrev Number: 9 (DW_TAG_member)
     <d07>   DW_AT_name        : (strp) (offset: 0x91f): flags
@@ -1730,15 +1730,15 @@
     <d28>   DW_AT_name        : (strp) (offset: 0x68d): PyGetSetDef
     <d2c>   DW_AT_byte_size   : (data1) 40
     <d2d>   DW_AT_decl_file   : (data1) 15
     <d2e>   DW_AT_decl_line   : (data1) 11
     <d2f>   DW_AT_decl_column : (data1) 16
     <d30>   DW_AT_sibling     : (ref4) <0xd76>
  <2><d34>: Abbrev Number: 9 (DW_TAG_member)
-    <d35>   DW_AT_name        : (strp) (offset: 0x1bea): name
+    <d35>   DW_AT_name        : (strp) (offset: 0x1bff): name
     <d39>   DW_AT_decl_file   : (data1) 15
     <d3a>   DW_AT_decl_line   : (data1) 12
     <d3b>   DW_AT_decl_column : (data1) 17
     <d3c>   DW_AT_type        : (ref4) <0x9c>, char
     <d40>   DW_AT_data_member_location: (data1) 0
  <2><d41>: Abbrev Number: 69 (DW_TAG_member)
     <d42>   DW_AT_name        : (string) get
@@ -1758,15 +1758,15 @@
     <d5c>   DW_AT_name        : (string) doc
     <d60>   DW_AT_decl_file   : (data1) 15
     <d61>   DW_AT_decl_line   : (data1) 15
     <d62>   DW_AT_decl_column : (data1) 17
     <d63>   DW_AT_type        : (ref4) <0x9c>, char
     <d67>   DW_AT_data_member_location: (data1) 24
  <2><d68>: Abbrev Number: 9 (DW_TAG_member)
-    <d69>   DW_AT_name        : (strp) (offset: 0x3651): closure
+    <d69>   DW_AT_name        : (strp) (offset: 0x3679): closure
     <d6d>   DW_AT_decl_file   : (data1) 15
     <d6e>   DW_AT_decl_line   : (data1) 16
     <d6f>   DW_AT_decl_column : (data1) 11
     <d70>   DW_AT_type        : (ref4) <0x7c>
     <d74>   DW_AT_data_member_location: (data1) 32
  <2><d75>: Abbrev Number: 0
  <1><d76>: Abbrev Number: 24 (DW_TAG_pointer_type)
@@ -1775,67 +1775,67 @@
  <1><d7c>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <d7d>   DW_AT_byte_size   : (data1) 8
     <d7e>   DW_AT_type        : (ref4) <0x187>, _typeobject
  <1><d82>: Abbrev Number: 99 (DW_TAG_structure_type)
     <d83>   DW_AT_name        : (strp) (offset: 0x193): _dictkeysobject
     <d87>   DW_AT_declaration : (flag_present) 1
  <1><d87>: Abbrev Number: 23 (DW_TAG_typedef)
-    <d88>   DW_AT_name        : (strp) (offset: 0x3f2d): Py_UCS4
+    <d88>   DW_AT_name        : (strp) (offset: 0x3f45): Py_UCS4
     <d8c>   DW_AT_decl_file   : (data1) 16
     <d8d>   DW_AT_decl_line   : (data1) 102
     <d8e>   DW_AT_decl_column : (data1) 18
     <d8f>   DW_AT_type        : (ref4) <0x100>, uint32_t, unsigned int
  <1><d93>: Abbrev Number: 23 (DW_TAG_typedef)
-    <d94>   DW_AT_name        : (strp) (offset: 0x3f25): Py_UCS2
+    <d94>   DW_AT_name        : (strp) (offset: 0x3f3d): Py_UCS2
     <d98>   DW_AT_decl_file   : (data1) 16
     <d99>   DW_AT_decl_line   : (data1) 103
     <d9a>   DW_AT_decl_column : (data1) 18
     <d9b>   DW_AT_type        : (ref4) <0xf4>, uint16_t, short unsigned int
  <1><d9f>: Abbrev Number: 23 (DW_TAG_typedef)
-    <da0>   DW_AT_name        : (strp) (offset: 0x2233): Py_UCS1
+    <da0>   DW_AT_name        : (strp) (offset: 0x2248): Py_UCS1
     <da4>   DW_AT_decl_file   : (data1) 16
     <da5>   DW_AT_decl_line   : (data1) 104
     <da6>   DW_AT_decl_column : (data1) 17
     <da7>   DW_AT_type        : (ref4) <0xe8>, uint8_t, unsigned char
  <1><dab>: Abbrev Number: 45 (DW_TAG_variable)
-    <dac>   DW_AT_name        : (strp) (offset: 0x20ce): PyUnicode_Type
+    <dac>   DW_AT_name        : (strp) (offset: 0x20e3): PyUnicode_Type
     <db0>   DW_AT_decl_file   : (data1) 16
     <db1>   DW_AT_decl_line   : (data1) 111
     <db2>   DW_AT_decl_column : (data1) 26
     <db3>   DW_AT_type        : (ref4) <0x176>, PyTypeObject, _typeobject
     <db7>   DW_AT_external    : (flag_present) 1
     <db7>   DW_AT_declaration : (flag_present) 1
  <1><db7>: Abbrev Number: 52 (DW_TAG_structure_type)
     <db8>   DW_AT_byte_size   : (data1) 4
     <db9>   DW_AT_decl_file   : (data1) 17
     <dba>   DW_AT_decl_line   : (data1) 162
     <dbb>   DW_AT_decl_column : (data1) 5
     <dbc>   DW_AT_sibling     : (ref4) <0xe11>
  <2><dc0>: Abbrev Number: 77 (DW_TAG_member)
-    <dc1>   DW_AT_name        : (strp) (offset: 0x4ed9): interned
+    <dc1>   DW_AT_name        : (strp) (offset: 0x4ed7): interned
     <dc5>   DW_AT_decl_file   : (data1) 17
     <dc6>   DW_AT_decl_line   : (data1) 171
     <dc7>   DW_AT_decl_column : (data1) 22
     <dc8>   DW_AT_type        : (ref4) <0x4f>, unsigned int
     <dcc>   DW_AT_byte_size   : (data1) 4
     <dcd>   DW_AT_bit_size    : (data1) 2
     <dce>   DW_AT_bit_offset  : (data1) 30
     <dcf>   DW_AT_data_member_location: (data1) 0
  <2><dd0>: Abbrev Number: 77 (DW_TAG_member)
-    <dd1>   DW_AT_name        : (strp) (offset: 0x18c5): kind
+    <dd1>   DW_AT_name        : (strp) (offset: 0x18da): kind
     <dd5>   DW_AT_decl_file   : (data1) 17
     <dd6>   DW_AT_decl_line   : (data1) 199
     <dd7>   DW_AT_decl_column : (data1) 22
     <dd8>   DW_AT_type        : (ref4) <0x4f>, unsigned int
     <ddc>   DW_AT_byte_size   : (data1) 4
     <ddd>   DW_AT_bit_size    : (data1) 3
     <dde>   DW_AT_bit_offset  : (data1) 27
     <ddf>   DW_AT_data_member_location: (data1) 0
  <2><de0>: Abbrev Number: 77 (DW_TAG_member)
-    <de1>   DW_AT_name        : (strp) (offset: 0x2dc7): compact
+    <de1>   DW_AT_name        : (strp) (offset: 0x2ddc): compact
     <de5>   DW_AT_decl_file   : (data1) 17
     <de6>   DW_AT_decl_line   : (data1) 204
     <de7>   DW_AT_decl_column : (data1) 22
     <de8>   DW_AT_type        : (ref4) <0x4f>, unsigned int
     <dec>   DW_AT_byte_size   : (data1) 4
     <ded>   DW_AT_bit_size    : (data1) 1
     <dee>   DW_AT_bit_offset  : (data1) 26
@@ -1847,15 +1847,15 @@
     <df7>   DW_AT_decl_column : (data1) 22
     <df8>   DW_AT_type        : (ref4) <0x4f>, unsigned int
     <dfc>   DW_AT_byte_size   : (data1) 4
     <dfd>   DW_AT_bit_size    : (data1) 1
     <dfe>   DW_AT_bit_offset  : (data1) 25
     <dff>   DW_AT_data_member_location: (data1) 0
  <2><e00>: Abbrev Number: 77 (DW_TAG_member)
-    <e01>   DW_AT_name        : (strp) (offset: 0x404f): ready
+    <e01>   DW_AT_name        : (strp) (offset: 0x4067): ready
     <e05>   DW_AT_decl_file   : (data1) 17
     <e06>   DW_AT_decl_line   : (data1) 213
     <e07>   DW_AT_decl_column : (data1) 22
     <e08>   DW_AT_type        : (ref4) <0x4f>, unsigned int
     <e0c>   DW_AT_byte_size   : (data1) 4
     <e0d>   DW_AT_bit_size    : (data1) 1
     <e0e>   DW_AT_bit_offset  : (data1) 24
@@ -1864,36 +1864,36 @@
  <1><e11>: Abbrev Number: 52 (DW_TAG_structure_type)
     <e12>   DW_AT_byte_size   : (data1) 48
     <e13>   DW_AT_decl_file   : (data1) 17
     <e14>   DW_AT_decl_line   : (data1) 85
     <e15>   DW_AT_decl_column : (data1) 9
     <e16>   DW_AT_sibling     : (ref4) <0xe5c>
  <2><e1a>: Abbrev Number: 9 (DW_TAG_member)
-    <e1b>   DW_AT_name        : (strp) (offset: 0x1212): ob_base
+    <e1b>   DW_AT_name        : (strp) (offset: 0x1227): ob_base
     <e1f>   DW_AT_decl_file   : (data1) 17
     <e20>   DW_AT_decl_line   : (data1) 159
     <e21>   DW_AT_decl_column : (data1) 5
     <e22>   DW_AT_type        : (ref4) <0x463>, PyObject, _object
     <e26>   DW_AT_data_member_location: (data1) 0
  <2><e27>: Abbrev Number: 9 (DW_TAG_member)
-    <e28>   DW_AT_name        : (strp) (offset: 0xee6): length
+    <e28>   DW_AT_name        : (strp) (offset: 0xefb): length
     <e2c>   DW_AT_decl_file   : (data1) 17
     <e2d>   DW_AT_decl_line   : (data1) 160
     <e2e>   DW_AT_decl_column : (data1) 16
     <e2f>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <e33>   DW_AT_data_member_location: (data1) 16
  <2><e34>: Abbrev Number: 9 (DW_TAG_member)
-    <e35>   DW_AT_name        : (strp) (offset: 0x3ca7): hash
+    <e35>   DW_AT_name        : (strp) (offset: 0x3cbf): hash
     <e39>   DW_AT_decl_file   : (data1) 17
     <e3a>   DW_AT_decl_line   : (data1) 161
     <e3b>   DW_AT_decl_column : (data1) 15
     <e3c>   DW_AT_type        : (ref4) <0x129>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <e40>   DW_AT_data_member_location: (data1) 24
  <2><e41>: Abbrev Number: 9 (DW_TAG_member)
-    <e42>   DW_AT_name        : (strp) (offset: 0x164a): state
+    <e42>   DW_AT_name        : (strp) (offset: 0x165f): state
     <e46>   DW_AT_decl_file   : (data1) 17
     <e47>   DW_AT_decl_line   : (data1) 217
     <e48>   DW_AT_decl_column : (data1) 7
     <e49>   DW_AT_type        : (ref4) <0xdb7>
     <e4d>   DW_AT_data_member_location: (data1) 32
  <2><e4e>: Abbrev Number: 9 (DW_TAG_member)
     <e4f>   DW_AT_name        : (strp) (offset: 0xb7d): wstr
@@ -1903,48 +1903,48 @@
     <e56>   DW_AT_type        : (ref4) <0xe5c>, wchar_t, int
     <e5a>   DW_AT_data_member_location: (data1) 40
  <2><e5b>: Abbrev Number: 0
  <1><e5c>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <e5d>   DW_AT_byte_size   : (data1) 8
     <e5e>   DW_AT_type        : (ref4) <0xae>, wchar_t, int
  <1><e62>: Abbrev Number: 23 (DW_TAG_typedef)
-    <e63>   DW_AT_name        : (strp) (offset: 0x45d3): PyASCIIObject
+    <e63>   DW_AT_name        : (strp) (offset: 0x45d1): PyASCIIObject
     <e67>   DW_AT_decl_file   : (data1) 17
     <e68>   DW_AT_decl_line   : (data1) 219
     <e69>   DW_AT_decl_column : (data1) 3
     <e6a>   DW_AT_type        : (ref4) <0xe11>
  <1><e6e>: Abbrev Number: 52 (DW_TAG_structure_type)
     <e6f>   DW_AT_byte_size   : (data1) 72
     <e70>   DW_AT_decl_file   : (data1) 17
     <e71>   DW_AT_decl_line   : (data1) 224
     <e72>   DW_AT_decl_column : (data1) 9
     <e73>   DW_AT_sibling     : (ref4) <0xeac>
  <2><e77>: Abbrev Number: 9 (DW_TAG_member)
-    <e78>   DW_AT_name        : (strp) (offset: 0x1214): _base
+    <e78>   DW_AT_name        : (strp) (offset: 0x1229): _base
     <e7c>   DW_AT_decl_file   : (data1) 17
     <e7d>   DW_AT_decl_line   : (data1) 225
     <e7e>   DW_AT_decl_column : (data1) 19
     <e7f>   DW_AT_type        : (ref4) <0xe62>, PyASCIIObject
     <e83>   DW_AT_data_member_location: (data1) 0
  <2><e84>: Abbrev Number: 9 (DW_TAG_member)
-    <e85>   DW_AT_name        : (strp) (offset: 0xee1): utf8_length
+    <e85>   DW_AT_name        : (strp) (offset: 0xef6): utf8_length
     <e89>   DW_AT_decl_file   : (data1) 17
     <e8a>   DW_AT_decl_line   : (data1) 226
     <e8b>   DW_AT_decl_column : (data1) 16
     <e8c>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <e90>   DW_AT_data_member_location: (data1) 48
  <2><e91>: Abbrev Number: 9 (DW_TAG_member)
     <e92>   DW_AT_name        : (strp) (offset: 0x227): utf8
     <e96>   DW_AT_decl_file   : (data1) 17
     <e97>   DW_AT_decl_line   : (data1) 228
     <e98>   DW_AT_decl_column : (data1) 11
     <e99>   DW_AT_type        : (ref4) <0x8a>, char
     <e9d>   DW_AT_data_member_location: (data1) 56
  <2><e9e>: Abbrev Number: 9 (DW_TAG_member)
-    <e9f>   DW_AT_name        : (strp) (offset: 0x3c3b): wstr_length
+    <e9f>   DW_AT_name        : (strp) (offset: 0x3c67): wstr_length
     <ea3>   DW_AT_decl_file   : (data1) 17
     <ea4>   DW_AT_decl_line   : (data1) 229
     <ea5>   DW_AT_decl_column : (data1) 16
     <ea6>   DW_AT_type        : (ref4) <0x118>, Py_ssize_t, ssize_t, __ssize_t, long int
     <eaa>   DW_AT_data_member_location: (data1) 64
  <2><eab>: Abbrev Number: 0
  <1><eac>: Abbrev Number: 23 (DW_TAG_typedef)
@@ -1962,27 +1962,27 @@
  <2><ec1>: Abbrev Number: 114 (DW_TAG_member)
     <ec2>   DW_AT_name        : (string) any
     <ec6>   DW_AT_decl_file   : (data1) 17
     <ec7>   DW_AT_decl_line   : (data1) 239
     <ec8>   DW_AT_decl_column : (data1) 15
     <ec9>   DW_AT_type        : (ref4) <0x7c>
  <2><ecd>: Abbrev Number: 90 (DW_TAG_member)
-    <ece>   DW_AT_name        : (strp) (offset: 0x4314): latin1
+    <ece>   DW_AT_name        : (strp) (offset: 0x432c): latin1
     <ed2>   DW_AT_decl_file   : (data1) 17
     <ed3>   DW_AT_decl_line   : (data1) 240
     <ed4>   DW_AT_decl_column : (data1) 18
     <ed5>   DW_AT_type        : (ref4) <0xef2>, Py_UCS1, uint8_t, unsigned char
  <2><ed9>: Abbrev Number: 90 (DW_TAG_member)
-    <eda>   DW_AT_name        : (strp) (offset: 0x30e2): ucs2
+    <eda>   DW_AT_name        : (strp) (offset: 0x30f7): ucs2
     <ede>   DW_AT_decl_file   : (data1) 17
     <edf>   DW_AT_decl_line   : (data1) 241
     <ee0>   DW_AT_decl_column : (data1) 18
     <ee1>   DW_AT_type        : (ref4) <0xef8>, Py_UCS2, uint16_t, short unsigned int
  <2><ee5>: Abbrev Number: 90 (DW_TAG_member)
-    <ee6>   DW_AT_name        : (strp) (offset: 0x30e7): ucs4
+    <ee6>   DW_AT_name        : (strp) (offset: 0x30fc): ucs4
     <eea>   DW_AT_decl_file   : (data1) 17
     <eeb>   DW_AT_decl_line   : (data1) 242
     <eec>   DW_AT_decl_column : (data1) 18
     <eed>   DW_AT_type        : (ref4) <0xefe>, Py_UCS4, uint32_t, unsigned int
  <2><ef1>: Abbrev Number: 0
  <1><ef2>: Abbrev Number: 24 (DW_TAG_pointer_type)
     <ef3>   DW_AT_byte_size   : (data1) 8
@@ -1996,115 +1996,115 @@
  <1><f04>: Abbrev Number: 52 (DW_TAG_structure_type)
     <f05>   DW_AT_byte_size   : (data1) 80
     <f06>   DW_AT_decl_file   : (data1) 17
     <f07>   DW_AT_decl_line   : (data1) 236
     <f08>   DW_AT_decl_column : (data1) 9
     <f09>   DW_AT_sibling     : (ref4) <0xf28>
  <2><f0d>: Abbrev Number: 9 (DW_TAG_member)
-    <f0e>   DW_AT_name        : (strp) (offset: 0x1214): _base
+    <f0e>   DW_AT_name        : (strp) (offset: 0x1229): _base
     <f12>   DW_AT_decl_file   : (data1) 17
     <f13>   DW_AT_decl_line   : (data1) 237
     <f14>   DW_AT_decl_column : (data1) 28
     <f15>   DW_AT_type        : (ref4) <0xeac>, PyCompactUnicodeObject
     <f19>   DW_AT_data_member_location: (data1) 0
  <2><f1a>: Abbrev Number: 9 (DW_TAG_member)
-    <f1b>   DW_AT_name        : (strp) (offset: 0x3956): data
+    <f1b>   DW_AT_name        : (strp) (offset: 0x397e): data
     <f1f>   DW_AT_decl_file   : (data1) 17
